[
    {
        "over": "19.3",
        "commentary": " Amir to Nabi, B0$ Caught by Finn Allen!! B1$ Great presence of mind! Nabi flat-bats this one towards long-on. It's traveling at great pace as it was hit with good amount of power. Allen near the fence leaps and reverse cups it. He realizes that the momentum will take him beyond the ropes so he flicks the ball back in the air before stepping beyond the ropes. He then steps back within the playing arena and catches it comfortably. B2$ ",
        "event": "WICKET",
        "clip": "clip_19.2_at_387_115678_1.mp4",
        "batsman": "Mohammad Nabi",
        "bowler": "Mohammad Amir"
    },
    {
        "over": "19.2",
        "commentary": " Amir to Nabi, B0$, back-to-back maximums! Another off-pace delivery but this time it's short. Nabi lines it up and pulls it with aplomb over deep mid-wicket. Clears the fence with ease ",
        "event": "SIX",
        "clip": "clip_19.1_at_375_115678_1.mp4",
        "batsman": "Mohammad Nabi",
        "bowler": "Mohammad Amir"
    },
    {
        "over": "18.5",
        "commentary": " Abbott to Nabi, 1 run, B0$ Off-pace shortish delivery outside off, Nabi mistimes his flat-batted stroke to mid-off. Shakeel takes it too easy and drops a sitter. That's a howler ",
        "event": "DROPPED",
        "clip": "clip_18.4_at_328_115678_1.mp4",
        "batsman": "Mohammad Nabi",
        "bowler": "Sean Abbott"
    },
    {
        "over": "16.4",
        "commentary": " Amir to James Vince, 1 run,B0$ He raises his bat and gets a good round of applause from the crowd. Shortish delivery on middle and leg, James Vince pulls it to long leg ",
        "event": "FIFTY",
        "clip": "clip_16.3_at_276_115678_1.mp4",
        "batsman": "James Vince",
        "bowler": "Mohammad Amir"
    },
    {
        "over": "16.2",
        "commentary": " Amir to James Vince, B0$, nicely done! Slower back of a length ball outside off, James Vince waits for it, opens his bat-face and places the cut past the right side of backward point to find the fence ",
        "event": "FOUR",
        "clip": "clip_16.1_at_262_115678_1.mp4",
        "batsman": "James Vince",
        "bowler": "Mohammad Amir"
    },
    {
        "over": "15.1",
        "commentary": " Abbott to Irfan Khan, B0$ Caught by Finn Allen!! Pitched up delivery on off, Irfan Khan whips it uppishly towards long-on. He doesn't get the required elevation and distance on the shot as he wasn't able to get underneath the ball. Finn Allen moves to his right and pouches it safely. B1$ ",
        "event": "WICKET",
        "clip": "clip_15_at_246_115678_1.mp4",
        "batsman": "Irfan Khan",
        "bowler": "Sean Abbott"
    },
    {
        "over": "14.2",
        "commentary": " Faheem Ashraf to James Vince, B0$, shot! Shortish delivery outside off, James Vince picks the length up in a jiffy and nails the pull over the leaping mid-wicket fielder to get the desired result ",
        "event": "FOUR",
        "clip": "clip_14.1_at_229_115678_1.mp4",
        "batsman": "James Vince",
        "bowler": "Faheem Ashraf"
    },
    {
        "over": "11.2",
        "commentary": " Ali Majid to Khushdil, B0$ Bowled!! Another one goes down! Chopped on! Khushdil kneels across on one knee to play the lap shot. It's quick through the air around off and skids after landing. Khushdil only manages to get an inside edge onto his front pad and then it deflects back onto the stumps. B1$ ",
        "event": "WICKET",
        "clip": "clip_11.1_at_212_115678_1.mp4",
        "batsman": "Khushdil Shah",
        "bowler": "Ali Majid"
    },
    {
        "over": "10.3",
        "commentary": " Saud Shakeel to James Vince, B0$, clean as a whistle! James Vince skips down the track to the in-drifter, converts it into a slot ball and smashes it over long-on for a maximum. That came right off the middle of the bat ",
        "event": "SIX",
        "clip": "clip_10.2_at_202_115678_1.mp4",
        "batsman": "James Vince",
        "bowler": "Saud Shakeel"
    },
    {
        "over": "9.5",
        "commentary": " Ali Majid to Mohammad Riazullah, B0$ Bowled!! Cleaned him up! Mohammad Riazullah kneels across on one knee and exposes his stumps. Ali Majid keeps it on a fuller length and drifts it in nicely. Mohammad Riazullah looks to sweep it towards fine leg but plays down the wrong line. The ball crashes into the off-stump. B1$ ",
        "event": "WICKET",
        "clip": "clip_9.4_at_187_115678_1.mp4",
        "batsman": "Mohammad Riazullah",
        "bowler": "Ali Majid"
    },
    {
        "over": "8.2",
        "commentary": " Saud Shakeel to James Vince, 1 run, B0$ floated full ball on middle, James Vince stays leg-side of it and drives it to long-off. James Vince takes off for the second run but he is sent back by Mohammad Riazullah. Saud Shakeel is not able to collect the throw cleanly. If he had grabbed the ball properly, James Vince was a goner. He was way outside the crease at that time ",
        "event": "RUNOUT_MISS",
        "clip": "clip_8.1_at_175_115678_1.mp4",
        "batsman": "James Vince",
        "bowler": "Saud Shakeel"
    },
    {
        "over": "6.2",
        "commentary": " Saud Shakeel to Seifert, B0$ Bowled!! Knocked him over! That's a good piece of bowling from Saud Shakeel! Slow through the air and on a back of a length on middle and off, straightens a bit. Seifert is caught in the crease as he plays for the original line but gets beaten on the outside edge. The ball hits the top of off. That's a special delivery for someone who is only a part-time bowler. B1$ ",
        "event": "WICKET",
        "clip": "clip_6.1_at_160_115678_1.mp4",
        "batsman": "Tim Seifert",
        "bowler": "Saud Shakeel"
    },
    {
        "over": "5.4",
        "commentary": " Abrar Ahmed to Warner, B0$ Caught by Faheem Ashraf!! Abrar Ahmed strikes and he is cock-a-hoop! A googly on a length on middle, turning away, Warner kneels down on one knee and goes for the big sweep across the line but only manages to get a top-edge. Faheem Ashraf at square leg moves back to his left and takes a well-judged catch. It perhaps wasn't the right length to go for the sweep and the ball turning away from Warner also worked against him. B1$ ",
        "event": "WICKET",
        "clip": "clip_5.3_at_150_115678_1.mp4",
        "batsman": "David Warner",
        "bowler": "Abrar Ahmed"
    },
    {
        "over": "5.2",
        "commentary": " Abrar Ahmed to Seifert, B0$, what a hit! Quicker through the air and it's the carrom ball on middle, Seifert reads it nicely and hits it over mid-on for a boundary. Almost carried all the way ",
        "event": "FOUR",
        "clip": "clip_5.1_at_133_115678_1.mp4",
        "batsman": "Tim Seifert",
        "bowler": "Abrar Ahmed"
    },
    {
        "over": "5.1",
        "commentary": " Abrar Ahmed to Seifert, B0$, hit with authority! Tossed up full ball on middle, Seifert clears his front leg and smashes it over mid-off for a one-bounce boundary. Good percentage stroke that ",
        "event": "FOUR",
        "clip": "clip_5_at_125_115678_1.mp4",
        "batsman": "Tim Seifert",
        "bowler": "Abrar Ahmed"
    },
    {
        "over": "4.5",
        "commentary": " Ali Majid to Seifert, B0$, 50 up for Karachi! A dragdown on off, Seifert makes a bit of room and slaps it past extra cover to pick up back-to-back boundaries ",
        "event": "TEAM_FIFTY,PARTNERSHIP,FOUR",
        "clip": "clip_4.4_at_115_115678_1.mp4",
        "batsman": "Tim Seifert",
        "bowler": "Ali Majid"
    },
    {
        "over": "4.4",
        "commentary": " Ali Majid to Seifert, B0$, in the slot on middle this time, Seifert clears his front leg and smashes it over the bowler's head for a rocketing boundary. It was a poor delivery and it got the treatment ",
        "event": "FOUR",
        "clip": "clip_4.4_at_115_115678_1.mp4",
        "batsman": "Tim Seifert",
        "bowler": "Ali Majid"
    },
    {
        "over": "3.2",
        "commentary": " Abbott to Warner, B0$, length ball well outside off, Warner reaches out and glides it with an open bat-face through backward point to pick up another boundary ",
        "event": "FOUR",
        "clip": "clip_3.1_at_99_115678_1.mp4",
        "batsman": "David Warner",
        "bowler": "Sean Abbott"
    },
    {
        "over": "3.1",
        "commentary": " Abbott to Warner, B0$, sloppy work! On a length outside off, Warner chops it onto the ground and it rolls towards short third. Amir doesn't account for the overspin on it and gets beaten to his left. He has a wry smile on his face after missing that ",
        "event": "FOUR",
        "clip": "clip_3_at_83_115678_1.mp4",
        "batsman": "David Warner",
        "bowler": "Sean Abbott"
    },
    {
        "over": "2.3",
        "commentary": " Amir to Warner, B0$, good timing! On a back of a length outside off, Warner punches it past the fielder at extra cover. The chase is on. The fielder slides near the fence but can't prevent the boundary ",
        "event": "FOUR",
        "clip": "clip_2.2_at_77_115678_1.mp4",
        "batsman": "David Warner",
        "bowler": "Mohammad Amir"
    },
    {
        "over": "1.5",
        "commentary": " Ali Majid to Warner, B0$, a juicy full-toss on off, Warner is a bit surprised by it but does well to hit it over mid-wicket to pick up a boundary. The third umpire checks for the height of the delivery but it's fine ",
        "event": "FOUR",
        "clip": "clip_1.4_at_51_115678_1.mp4",
        "batsman": "David Warner",
        "bowler": "Ali Majid"
    },
    {
        "over": "1.4",
        "commentary": " Ali Majid to Warner, B0$, on the shorter side on off, Warner stays leg-side of it, rocks back and cuts it crisply past the left side of the diving fielder at extra cover. Good placement ",
        "event": "FOUR",
        "clip": "clip_1.3_at_39_115678_1.mp4",
        "batsman": "David Warner",
        "bowler": "Ali Majid"
    },
    {
        "over": "0.3",
        "commentary": " Amir to Seifert, B0$, nicely played! Fullish ball down leg, Seifert whips it over backward square leg to find the fence ",
        "event": "FOUR",
        "clip": "clip_0.2_at_10_115678_1.mp4",
        "batsman": "Tim Seifert",
        "bowler": "Mohammad Amir"
    },
    {
        "over": "19.5",
        "commentary": " Mir Hamza to Ali Majid, B0$, full ball once again from Mir Hamza, Majid looks to heave and gets it off the thick inside edge that runs away to the deep square fence ",
        "event": "FOUR",
        "clip": "clip_19.4_at_942_115678_2.mp4",
        "batsman": "Ali Majid",
        "bowler": "Mir Hamza"
    },
    {
        "over": "19.4",
        "commentary": " Mir Hamza to Ali Majid, B0$, I0$ full delivery from round the wicket, Majid swings hard and gets a thick outside edge that flies past the leaping keeper to his right ",
        "event": "FOUR",
        "clip": "clip_19.3_at_935_115678_2.mp4",
        "batsman": "Ali Majid",
        "bowler": "Mir Hamza"
    },
    {
        "over": "18.4",
        "commentary": " Hasan Ali to Abrar Ahmed, B0$ Bowled!! The leg stump goes for a walk. Slower full delivery from Hasan Ali. Abrar Ahmed gave himself too much room and got nowhere near the line of the delivery. You miss I hit stuff. B1$ ",
        "event": "WICKET",
        "clip": "clip_18.3_at_886_115678_2.mp4",
        "batsman": "Abrar Ahmed",
        "bowler": "Hasan Ali"
    },
    {
        "over": "16.5",
        "commentary": " Aamer Jamal to Amir, B0$ Bowled!! Loses his leg stump this time. Shuffled a bit too far against the slower length delivery and couldn't get anywhere near the line of the delivery. Past the attempted scoop and hits the top of leg peg. B1$ ",
        "event": "WICKET",
        "clip": "clip_16.4_at_843_115678_2.mp4",
        "batsman": "Mohammad Amir",
        "bowler": "Aamer Jamal"
    },
    {
        "over": "16.4",
        "commentary": " Aamer Jamal to Amir, B0$, that's an impressive hit from Mohammad Amir. I0$ full outside off, Amir made room early and carved it up and over extra cover to bring up the B1$ ",
        "event": "TEAM_HUNDRED,SIX",
        "clip": "clip_16.3_at_832_115678_2.mp4",
        "batsman": "Mohammad Amir",
        "bowler": "Aamer Jamal"
    },
    {
        "over": "15.1",
        "commentary": " Hasan Ali to Saud Shakeel, B0$, bumper on the stumps, Shakeel shapes up to pull and gets a thick top-edge that runs away past the fielder at fine leg to his left ",
        "event": "FOUR",
        "clip": "clip_15_at_817_115678_2.mp4",
        "batsman": "Saud Shakeel",
        "bowler": "Hasan Ali"
    },
    {
        "over": "14.4",
        "commentary": " Khushdil to Amir, B0$, jumps out of his crease and swipes the teasing full delivery for a mighty maximum over mid-wicket. That was hit with some power from Mohammad Amir ",
        "event": "SIX",
        "clip": "clip_14.3_at_798_115678_2.mp4",
        "batsman": "Mohammad Amir",
        "bowler": "Khushdil Shah"
    },
    {
        "over": "14.3",
        "commentary": " Khushdil to Amir, B0$, tossed up wide of off, Amir stays low and sweeps it in the gap over mid-wicket, right in the gap between the two fielders in the deep ",
        "event": "FOUR",
        "clip": "clip_14.2_at_789_115678_2.mp4",
        "batsman": "Mohammad Amir",
        "bowler": "Khushdil Shah"
    },
    {
        "over": "11.4",
        "commentary": " Abbas Afridi to Abbott, B0$ Lbw!! That was clipping the leg peg according to ball tracker. It was a full ball that curled in late to trap Abbott right in front of middle and leg. It looked really close and only the angle could have saved Abbott there. Not to be. Umpire's call on hitting. B1$ ",
        "event": "WICKET,UDRS",
        "clip": "clip_11.3_at_746_115678_2.mp4",
        "batsman": "Sean Abbott",
        "bowler": "Abbas Afridi"
    },
    {
        "over": "9.3",
        "commentary": " Nabi to Abbott, byes, B0$, tries to sweep a full delivery and misses, the ball stays low and nutmegs the keeper before going past the under edge ",
        "event": "TEAM_FIFTY,FOUR",
        "clip": "clip_9.2_at_710_115678_2.mp4",
        "batsman": "Sean Abbott",
        "bowler": "Mohammad Nabi"
    },
    {
        "over": "5.5",
        "commentary": " Nabi to Rossouw, B0$ Caught by Aamer Jamal!! The Gladiators are falling apart here. After 4 successive dots, Rossouw looks to belt this over extra cover by making room. Doesn't get the desired connection on the loft and picks out the fielder at wide long-off to his right. Excellent running catch that from Jamal. B1$ ",
        "event": "WICKET",
        "clip": "clip_5.4_at_656_115678_2.mp4",
        "batsman": "Rilee Rossouw",
        "bowler": "Mohammad Nabi"
    },
    {
        "over": "4.3",
        "commentary": " Hasan Ali to Khawaja Nafay, B0$ Caught by Aamer Jamal!! Hasan Ali strikes again. He runs towards the short third area before unleashing his signature celebration. Banged in short wide of off, Nafay looks to play the ramp but the pace and extra bounce got the better of him. Ended up skewing it off the cue end and found the fielder at third man. B1$ ",
        "event": "WICKET",
        "clip": "clip_4.2_at_630_115678_2.mp4",
        "batsman": "Khawaja Nafay",
        "bowler": "Hasan Ali"
    },
    {
        "over": "3.5",
        "commentary": " Nabi to Kusal Mendis, B0$ Caught by Hasan Ali!! Excellent start for the Kings with the ball. That was a drag down from Mohammad Nabi, Mendis shaped up to pull but the ball arrived much quicker than anticipated. He ends up skewing it off the thick inside half and picks out the fielder at short fine to his left. B1$ ",
        "event": "WICKET",
        "clip": "clip_3.4_at_615_115678_2.mp4",
        "batsman": "Kusal Mendis",
        "bowler": "Mohammad Nabi"
    },
    {
        "over": "1.5",
        "commentary": " Hasan Ali to Kusal Mendis, B0$, plenty of width outside off, Mendis throws his hands on the cut and gets the ball flying over the fielder at backward point to his left ",
        "event": "FOUR",
        "clip": "clip_1.4_at_574_115678_2.mp4",
        "batsman": "Kusal Mendis",
        "bowler": "Hasan Ali"
    },
    {
        "over": "1.3",
        "commentary": " Hasan Ali to Saud Shakeel, B0$, half-volley in the slot outside off at I0$, Shakeel shows full face of the bat and creams the drive all along the ground to the right of extra cover ",
        "event": "FOUR",
        "clip": "clip_1.2_at_566_115678_2.mp4",
        "batsman": "Saud Shakeel",
        "bowler": "Hasan Ali"
    },
    {
        "over": "1.1",
        "commentary": " Hasan Ali to Hasan Nawaz, B0$ Caught by Khushdil!! A wicket first ball for Hasan Ali. He bowls the perfect away swinger in the fifth stump channel. Hasan Nawaz pokes with hard hands and gets a thick outside edge to the left of lone slip. Khushdil shows excellent reflexes with a timley dive to his left to take a fine low catch. B1$ ",
        "event": "WICKET",
        "clip": "clip_1.1_at_545_115678_2.mp4",
        "batsman": "Hasan Nawaz",
        "bowler": "Hasan Ali"
    },
    {
        "over": "0.5",
        "commentary": " Mir Hamza to Finn Allen, B0$ Caught by Nabi!! Six and gone. Mid-on was pushed back after the six and the plan has worked for the Kings. Hamza bowls it full and gets the ball to angle away at pace, Allen tried to force it down the ground with a heave and ends up skewing it off the cue end of the bat. Nabi at long-on runs across to his left and takes the catch on the second attempt. B1$ ",
        "event": "WICKET",
        "clip": "clip_0.4_at_515_115678_2.mp4",
        "batsman": "Finn Allen",
        "bowler": "Mir Hamza"
    },
    {
        "over": "19.1",
        "commentary": " Mohammad Ali to Holder, B0$, half volley delivery onto middle and leg, Holder clears the front leg and slams it over deep square for a maximum ",
        "event": "SIX",
        "clip": "clip_19.1_at_683.0_115653_1.mp4",
        "batsman": "Jason Holder",
        "bowler": "Mohammad Ali"
    },
    {
        "over": "18.5",
        "commentary": " Talat to Dwarshuis, 2 runs, B0$ Once again an undercooked yorker. Dwarshuis hoists it down the ground and gets more elevation than distance. Easy high catch for Babar goes down ",
        "event": "DROPPED",
        "clip": "clip_18.4_at_674.0_115653_1.mp4",
        "batsman": "Ben Dwarshuis",
        "bowler": "Hussain Talat"
    },
    {
        "over": "18.4",
        "commentary": " Talat to Dwarshuis, B0$, attempted yorker, slightly undercooked and Dwarshuis stays deep in his crease and heave it over deep mid-wicket. Babar is the fielder standing by the ropes, who gets a hand to it but can parry it beyond ",
        "event": "SIX",
        "clip": "clip_18.3_at_663.0_115653_1.mp4",
        "batsman": "Ben Dwarshuis",
        "bowler": "Hussain Talat"
    },
    {
        "over": "18.1",
        "commentary": "Talat to Salman Agha, B0$ Caught by Kohler-Cadmore!! full, wide delivery outside off. Salman Agha drives at it through extra cover where Kohler-Cadmore takes a solid low, tumbling catch. Did really well to get his fingers under it. A well set Salman Agha is out! B1$",
        "event": "WICKET",
        "clip": "clip_18.0_at_616.0_115653_1.mp4",
        "batsman": "Salman Agha",
        "bowler": "Hussain Talat"
    },
    {
        "over": "16.5",
        "commentary": " Talat to Salman Agha, B0$, short of length and pace off, Agha backs away and slams it towards cow corner. The fielder reaches to the ball but can't hold on, ends up pushing it over the ropes for six ",
        "event": "TEAM_HUNDRED,DROPPED,SIX",
        "clip": "clip_16.4_at_600.0_115653_1.mp4",
        "batsman": "Salman Agha",
        "bowler": "Hussain Talat"
    },
    {
        "over": "16.1",
        "commentary": " Talat to Azam Khan, B0$ Caught by Saim Ayub!! A crucial breakthrough for Peshawar. A low full toss angling onto the stumps, Azam Khan shuffled in to heave it across the line. Didn't get fully under the ball and ends up holing out to deep mid-wicket B1$ ",
        "event": "WICKET",
        "clip": "clip_16.0_at_561.0_115653_1.mp4",
        "batsman": "Azam Khan",
        "bowler": "Hussain Talat"
    },
    {
        "over": "15.4",
        "commentary": " Mohammad Ali to Azam Khan, B0$, slower delivery that was wide outside off. Azam reaches for it and slams it over long-off for a maximum. All muscle on that shot, generated the complete power for it and sends it sailing ",
        "event": "SIX",
        "clip": "clip_15.3_at_531.0_115653_1.mp4",
        "batsman": "Azam Khan",
        "bowler": "Mohammad Ali"
    },
    {
        "over": "14.1",
        "commentary": " Ali Raza to Salman Agha, B0$, a full toss around knee high. Salman Agha shuffles in and ramps this one over short fine for a boundary ",
        "event": "FOUR",
        "clip": "clip_14.1_at_529.0_115653_1.mp4",
        "batsman": "Salman Agha",
        "bowler": "Ali Raza"
    },
    {
        "over": "13.4",
        "commentary": "Alzarri Joseph to Sahibzada Farhan, B0$ Caught by Talat!! Farhan's superb hand comes to an end, he walks off to a rousing reception from the crowd and from the dug-out, what a sensational hundred this has been. Was a short and wide ball of off and he saw the chance of going over the top, but he got too far underneath it on the carve, plenty of height and no real distance - Talat settled himself at third man and held on. B1$",
        "event": "WICKET",
        "clip": "clip_13.3_at_484.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Alzarri Joseph"
    },
    {
        "over": "13.2",
        "commentary": " Alzarri Joseph to Azam Khan, B0$, first ball six!! Joseph tried to test out Azam Khan with a short ball first up. The batter goes for the pull and gets a top edge that sends it sailing beyond fine leg ",
        "event": "SIX",
        "clip": "clip_13.1_at_449.0_115653_1.mp4",
        "batsman": "Azam Khan",
        "bowler": "Alzarri Joseph"
    },
    {
        "over": "13.1",
        "commentary": " Alzarri Joseph to Munro, B0$ Caught by Mohammad Haris!! Much needed breakthrough for Peshawar! A slower length ball onto leg stump, Munro tried to ramp sweep it away but the ball just gets a bit of extra bounce and lobs off his gloves to the right of the keeper. Can Peshawar put the breaks on now? B1$ ",
        "event": "WICKET",
        "clip": "clip_13.0_at_437.0_115653_1.mp4",
        "batsman": "Colin Munro",
        "bowler": "Alzarri Joseph"
    },
    {
        "over": "12.5",
        "commentary": " Sufiyan Muqeem to Sahibzada Farhan, B0$, fuller onto middle stump, Farhan clears the front leg and plays a big slog sweep over deep mid-wicket for six. Normal service resumed after the century there!! ",
        "event": "TEAM_HUNDRED,SIX",
        "clip": "clip_12.4_at_420.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Sufiyan Muqeem"
    },
    {
        "over": "12.2",
        "commentary": " Sufiyan Muqeem to Munro, B0$, too short and at the stump, Munro stays still and slaps it over the bowler's head for a boundary ",
        "event": "FOUR",
        "clip": "clip_12.1_at_407.0_115653_1.mp4",
        "batsman": "Colin Munro",
        "bowler": "Sufiyan Muqeem"
    },
    {
        "over": "12.1",
        "commentary": " Sufiyan Muqeem to Sahibzada Farhan, 1 run, a hundred to savour for Sahibzada Farhan!! B0$ A shortish delivery onto the stumps, punched down to long-on and Farhan has his fist up in celebration as he runs the single. Soaks in the applause and gets a big hug from his partner Munro. A look towards the heavens almost in relief now from the Islamabad batter. ",
        "event": "HUNDRED",
        "clip": "clip_12.0_at_402.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Sufiyan Muqeem"
    },
    {
        "over": "11.3",
        "commentary": " Linde to Sahibzada Farhan, B0$, smoked away! Short and spins away from off, Farhan stays back in his crease and pulls it straight down the ground for a maximum. Got plenty of bottom hand power on that one... ",
        "event": "SIX",
        "clip": "clip_11.2_at_379.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "George Linde"
    },
    {
        "over": "10.3",
        "commentary": " Ali Raza to Sahibzada Farhan, B0$, hat-trick of fours now!! Raza shortens the length and hits the deck hard outside off. Farhan stays in his crease and punches it through covers for a boundary. The young bowler is being taken to the cleaners here ",
        "event": "FOUR",
        "clip": "clip_10.2_at_371.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Ali Raza"
    },
    {
        "over": "10.2",
        "commentary": " Ali Raza to Sahibzada Farhan, B0$, full and wide outside off, Farhan throws his arms at it as he slashes the ball. Fies off the outer edge and over short third for a boundary ",
        "event": "FOUR",
        "clip": "clip_10.1_at_366.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Ali Raza"
    },
    {
        "over": "10.1",
        "commentary": " Ali Raza to Sahibzada Farhan, B0$, pace off full delivery outside off, Farhan was ready on it and shuffled inwards to ramp it upon pitching to the right of short fine ",
        "event": "FOUR",
        "clip": "clip_10.0_at_354.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Ali Raza"
    },
    {
        "over": "9.5",
        "commentary": " Saim Ayub to Sahibzada Farhan, 1 run, tossed up on middle and leg, worked down to long-on for a single ",
        "event": "PARTNERSHIP",
        "clip": "clip_9.5_at_346.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Saim Ayub"
    },
    {
        "over": "8.5",
        "commentary": " Sufiyan Muqeem to Sahibzada Farhan, B0$, back-to-back boundaries for Farhan - Muqeem dragged the length back, but it's a tad too short and Farhan pounces, backs away and cuts it into the gap wide of cover ",
        "event": "TEAM_HUNDRED,FOUR",
        "clip": "clip_8.4_at_336.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Sufiyan Muqeem"
    },
    {
        "over": "7.3",
        "commentary": " Talat to Sahibzada Farhan, 1 run, on a length and just outside off, Farhan flat-bats it to the left of mid-off and is off for a single - B0$ ",
        "event": "FIFTY",
        "clip": "clip_7.2_at_321.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Hussain Talat"
    },
    {
        "over": "5.1",
        "commentary": " Mohammad Ali to Munro, B0$, the momentum is firmly with IU now, Munro shimmies down the pitch and then goes through with the whipped on-drive, caught the inner half, but he's placed it wide of mid-on ",
        "event": "FOUR",
        "clip": "clip_5.0_at_313.0_115653_1.mp4",
        "batsman": "Colin Munro",
        "bowler": "Mohammad Ali"
    },
    {
        "over": "4.5",
        "commentary": " Ali Raza to Sahibzada Farhan, B0$, B1$, this is turning out to be an expensive over, back of a length and just outside off - no real pace and Farhan has plenty of time to smash the pull over deep mid-wicket ",
        "event": "SIX",
        "clip": "clip_4.4_at_295.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Ali Raza"
    },
    {
        "over": "4.3",
        "commentary": " Ali Raza to Sahibzada Farhan, B0$, B1$. this was a proper half-volley though, Farhan gets forward and then hammers the drive wide of mid-off, back-to-back boundaries and he's on a roll ",
        "event": "TEAM_FIFTY,FOUR",
        "clip": "clip_4.3_at_293.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Ali Raza"
    },
    {
        "over": "4.2",
        "commentary": " Ali Raza to Sahibzada Farhan, B0$, B1$, on a length and angling into the right-hander, Farhan clears his front-leg and then whip drives it wide of mid-on, no need to run for those ",
        "event": "FOUR",
        "clip": "clip_4.1_at_273.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Ali Raza"
    },
    {
        "over": "3.3",
        "commentary": " Linde to Sahibzada Farhan, B0$, B1$, tad too full from Linde, was sliding onto the right-hander, but Farhan backed away, gets under the length and then smotes it high over long-on for a maximum ",
        "event": "SIX",
        "clip": "clip_3.2_at_248.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "George Linde"
    },
    {
        "over": "3.1",
        "commentary": " Linde to Sahibzada Farhan, B0$, B1$, Farhan brings out the reverse sweep immediately, gets down low, uses the angle and then gets enough on the shot to clear backward point ",
        "event": "FOUR",
        "clip": "clip_3.0_at_236.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "George Linde"
    },
    {
        "over": "2.3",
        "commentary": " Alzarri Joseph to Munro, B0$, B1$, tad too full and just outside off, Munro leans across and places the drive wide of cover for a boundary ",
        "event": "FOUR",
        "clip": "clip_2.2_at_229.0_115653_1.mp4",
        "batsman": "Colin Munro",
        "bowler": "Alzarri Joseph"
    },
    {
        "over": "2.1",
        "commentary": "Alzarri Joseph to Munro, B0$, nicely played, tad too full and just outside leg, Munro leans forward and then chips the drive over mid-off for a boundary",
        "event": "FOUR",
        "clip": "clip_2.0_at_216.0_115653_1.mp4",
        "batsman": "Colin Munro",
        "bowler": "Alzarri Joseph"
    },
    {
        "over": "1.5",
        "commentary": "Mohammad Ali to Sahibzada Farhan, B0$, back of a length and well wide of off, punched straight to the fielder at cover-point",
        "event": "FOUR",
        "clip": "clip_1.4_at_203.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Mohammad Ali"
    },
    {
        "over": "1.2",
        "commentary": "Mohammad Ali to Sahibzada Farhan, B0$ Gous Run Out!! 2 runs completed!! There's an appeal for a run-out at the striker's end - it's TKC and he's done superbly to flick the ball onto the stumps, has it caught Gous short? Yes, he was lazily pushing his bat into the crease, but the zing bails light up with the bat short of the ground. B1$. First up, was a short ball down leg and Farhan missed the pull, flicked the thigh and rolled behind square on thew on-side, the chase is laborious and they look to sneak in a third, but TKC comes across, he's back to he action, collects the ball one-handed and then flicks it onto the stumps, the zing bails light up and Gous has to go. B2$",
        "event": "WICKET",
        "clip": "clip_1.1_at_165.0_115653_1.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Mohammad Ali"
    },
    {
        "over": "18.2",
        "commentary": " Dwarshuis to Mohammad Ali, B0$ Bowled!! Knocked over! A length ball angling onto off stump, beats Mohammad Ali on the outside edge and pegs back the stumps. B1$B2$ ",
        "event": "WICKET",
        "clip": "clip_18.1_at_1296.0_115653_2.mp4",
        "batsman": "Mohammad Ali",
        "bowler": "Ben Dwarshuis"
    },
    {
        "over": "16.4",
        "commentary": " Imad Wasim to Mohammad Haris, B0$ Caught by (sub)Nawaz!! Out this time. Haris denied a century! Smart from Imad Wasim as he keeps it shorter and darts it quicker. The batter shimmied down the track, wasn't at the pitch of it but goes through with his shot. Ends up hitting it down to long-on where the sub fielder Nawaz takes his fourth catch. B1$ ",
        "event": "WICKET",
        "clip": "clip_16.3_at_1258.0_115653_2.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Imad Wasim"
    },
    {
        "over": "16.3",
        "commentary": " Imad Wasim to Mohammad Haris, B0$, tossed up on middle, right in the arc for Mohammad Haris to play a big slog sweep over deep mid-wicket! All the way for six ",
        "event": "SIX",
        "clip": "clip_16.2_at_1244.0_115653_2.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Imad Wasim"
    },
    {
        "over": "15.3",
        "commentary": " Shadab Khan to Sufiyan Muqeem, B0$ Bowled!! Knocked over! Shadab is having a bit of fun out here against the tailenders. A googly that straightens onto off stump from round the wicket. Muqeem tried an extravagent switch hit and ends up looking a bit foolish in the end as he loses his off stump. B1$ ",
        "event": "WICKET",
        "clip": "clip_15.2_at_1206.0_115653_2.mp4",
        "batsman": "Sufiyan Muqeem",
        "bowler": "Shadab Khan"
    },
    {
        "over": "13.3",
        "commentary": " Shadab Khan to Alzarri Joseph, B0$ Caught by (sub)Nawaz!! Third catch for the sub fielder Nawaz here! A full delivery onto middle, Joseph swings down the ground but gets it off the toe-end. Easy catch for long-on. Peshawar are crumbling here. B1$ ",
        "event": "WICKET",
        "clip": "clip_13.2_at_1176.0_115653_2.mp4",
        "batsman": "Alzarri Joseph",
        "bowler": "Shadab Khan"
    },
    {
        "over": "12.5",
        "commentary": " Saad Masood to Linde, B0$ Caught by (sub)Nawaz!! First PSL wicket for Saad Masood. A full delivery outside off, Linde tried to dig that one out but ends up hitting it in the air towards long-off. Ends a woeful time at the crease for George Linde, was struggling to read the spinners here. B1$ ",
        "event": "WICKET",
        "clip": "clip_12.4_at_1142.0_115653_2.mp4",
        "batsman": "George Linde",
        "bowler": "Saad Masood"
    },
    {
        "over": "12.1",
        "commentary": " Saad Masood to Mohammad Haris, B0$, fuller and slides onto leg stump, Haris makes a bit of room and heaves it to the right of long-on for a boundary ",
        "event": "FOUR",
        "clip": "clip_12.0_at_1133.0_115653_2.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Saad Masood"
    },
    {
        "over": "11.2",
        "commentary": " Shadab Khan to Mohammad Haris, B0$, flat delivery that skids through outside off, Haris tries to cut and gets a thick outer edge. Goes through the hands of short third for a boundary, should hav been stopped there ",
        "event": "FOUR",
        "clip": "clip_11.1_at_1128.0_115653_2.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Shadab Khan"
    },
    {
        "over": "11.1",
        "commentary": " Shadab Khan to Mohammad Haris, B0$, tossed up delivery, Haris clears the front leg and slams it down the ground for a boundary. That'll be 50 for the Pakistani keeper batter ",
        "event": "FIFTY,FOUR",
        "clip": "clip_11.0_at_1122.0_115653_2.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Shadab Khan"
    },
    {
        "over": "9.4",
        "commentary": " Shadab Khan to Mohammad Haris, B0$, B1$, very full from Shadab - was the wrong 'un and was sneaking under Haris's bat, but he gets down low, sweeps on top of the bounce and beats short fine to his left ",
        "event": "FOUR",
        "clip": "clip_9.4_at_1089.0_115653_2.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Shadab Khan"
    },
    {
        "over": "9.2",
        "commentary": " Shadab Khan to Mohammad Haris, B0$, flighted delivery outside off - Haris bends down low, reverses his stance and then gets enough the sweep to clear short third man, bounces away to the ropes ",
        "event": "FOUR",
        "clip": "clip_9.1_at_1080.0_115653_2.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Shadab Khan"
    },
    {
        "over": "8.5",
        "commentary": " Imad Wasim to Talat, B0$, B1$, tossed up invitingly outside off - Talat bends down low, uses the angle and then plays the slog-sweep, high and over mid-wicket, for a maximum ",
        "event": "SIX",
        "clip": "clip_8.4_at_1050.0_115653_2.mp4",
        "batsman": "Hussain Talat",
        "bowler": "Imad Wasim"
    },
    {
        "over": "8.1",
        "commentary": " Imad Wasim to Kohler-Cadmore, B0$ Caught by Sahibzada Farhan!! A sharp catch at long-on and the wickets keep falling. Was pushed through with a flatter trajectory by Imad, TKC backed away and then tried to go back over the bowler's head, but the angle undid him, ended up dragging it down towards long-on - Sahibzada ran in, slid forward and completed a fine catch. B1$ ",
        "event": "WICKET",
        "clip": "clip_8.0_at_993.0_115653_2.mp4",
        "batsman": "Tom Kohler-Cadmore",
        "bowler": "Imad Wasim"
    },
    {
        "over": "7.3",
        "commentary": " Holder to Mohammad Haris, B0$, B1$, the slower short ball from Holder, but it simply sat up to be smacked, Haris gets on top of the bounce and then pummels it over square leg for a maximum ",
        "event": "SIX",
        "clip": "clip_7.2_at_972.0_115653_2.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Jason Holder"
    },
    {
        "over": "5.5",
        "commentary": " Naseem Shah to Mohammad Haris, B0$, B1$, another slower ball from Naseem, but Haris has got this one away - was the cutter, but he made space by backing away, opens the face of the bat and then sliced it over backward point ",
        "event": "FOUR",
        "clip": "clip_5.4_at_969.0_115653_2.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Naseem Shah"
    },
    {
        "over": "3.5",
        "commentary": "Naseem Shah to Saim Ayub, B0$ Caught by (sub)Muhammad Shahzad!! Catching practice at deep square leg and the B1$, banged in short and this was bowled at pace - Ayub picked the length, swivelled across and then pulled it over square leg, but he didn't bother to keep it down, no elevation and it's a straightforward catch to the man in the deep. B2$",
        "event": "WICKET",
        "clip": "clip_3.4_at_904.0_115653_2.mp4",
        "batsman": "Saim Ayub",
        "bowler": "Naseem Shah"
    },
    {
        "over": "2.5",
        "commentary": " Imad Wasim to Mohammad Haris, B0$, a pre-meditated reverse sweep, Imad saw it coming and tried to follow him, turns out to be a low full-toss and it's swept behind point ",
        "event": "FOUR",
        "clip": "clip_2.4_at_894.0_115653_2.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Imad Wasim"
    },
    {
        "over": "2.2",
        "commentary": " Imad Wasim to Mitchell Owen, B0$ Lbw!! this looks close, but umpire Aleem Dar ain't impressed. They gather once again and B1$. Did he get an inside edge? That otherwise loked pretty straight. No bat and UltraEdge confirms the same. Onto ball-tracking: It's three reds, crashing into the top of middle-stump - B2$ and Zalmi have lost two now. Was the slider from Wasim, pushed it quicker and flatter, the length was short for the pull, but the ball skidded on and beat Owen, bang in front of middle. B3$ ",
        "event": "WICKET,UDRS",
        "clip": "clip_2.1_at_846.0_115653_2.mp4",
        "batsman": "Mitchell Owen",
        "bowler": "Imad Wasim"
    },
    {
        "over": "1.4",
        "commentary": " Dwarshuis to Mitchell Owen, B0$, B1$, Owen shimmies down the pitch, makes room and then slaps the drive over extra-cover, bounces away to the ropes in a hurry ",
        "event": "FOUR",
        "clip": "clip_1.3_at_844.0_115653_2.mp4",
        "batsman": "Mitchell Owen",
        "bowler": "Ben Dwarshuis"
    },
    {
        "over": "1.3",
        "commentary": " Dwarshuis to Mitchell Owen, B0$, B1$, back of a length and angling across the right-hander - Owen stands tall and then plays a fore-hand smash, high and over mid-wicket for a maximim ",
        "event": "SIX",
        "clip": "clip_1.2_at_815.0_115653_2.mp4",
        "batsman": "Mitchell Owen",
        "bowler": "Ben Dwarshuis"
    },
    {
        "over": "1.1",
        "commentary": "Dwarshuis to Babar Azam, B0$ Caught by Holder!! Edged and caught! Babar Azam's woes continue, on a good length and pushed across the right-hander, Babar's feet hardly went anywhere as he shaped for the drive, doesn't cover for the angle and gets a thick edge to 1st slip's right - Holder dives across and pouches a safe catch with his bucket hands. Disappointment for the crowd once again the Pakistan superstar departs. B1$",
        "event": "WICKET",
        "clip": "clip_1.1_at_788.0_115653_2.mp4",
        "batsman": "Babar Azam",
        "bowler": "Ben Dwarshuis"
    },
    {
        "over": "19.3",
        "commentary": " Shaheen Afridi to Iftikhar Ahmed, B0$, B1$ High full-toss outside off, Iftikhar Ahmed slapped it away hard over backward point, managed to get enough on it to just about hits the ropes on the full, was nearly a no-ball too for height ",
        "event": "SIX",
        "clip": "clip_19.2_at_445.0884086384_115698_1.mp4",
        "batsman": "Iftikhar Ahmed",
        "bowler": "Shaheen Afridi"
    },
    {
        "over": "19.2",
        "commentary": " Shaheen Afridi to Iftikhar Ahmed, 2 runs, B0$ Full toss on middle, Iftikhar Ahmed missed out here as he just chipped it out towards deep mid-wicket, should've been gobbled up but the fielder put it down, two extra runs ",
        "event": "DROPPED",
        "clip": "clip_19.1_at_433.47740667392003_115698_1.mp4",
        "batsman": "Iftikhar Ahmed",
        "bowler": "Shaheen Afridi"
    },
    {
        "over": "18.5",
        "commentary": " Haris Rauf to Iftikhar Ahmed, B0$, B1$ Juicy full-toss outside off, Iftikhar Ahmed smacks it away over long-off with ease ",
        "event": "SIX",
        "clip": "clip_18.4_at_422.83398820648_115698_1.mp4",
        "batsman": "Iftikhar Ahmed",
        "bowler": "Haris Rauf"
    },
    {
        "over": "18.4",
        "commentary": " Haris Rauf to Iftikhar Ahmed, B0$, B1$ Very full just outside off, missed the yorker by just a bit, Iftikhar Ahmed stepped across and drilled it straight back ",
        "event": "FOUR",
        "clip": "clip_18.4_at_422.83398820648_115698_1.mp4",
        "batsman": "Iftikhar Ahmed",
        "bowler": "Haris Rauf"
    },
    {
        "over": "18.2",
        "commentary": " Haris Rauf to Iftikhar Ahmed, B0$, streaky! Full and slow wide outside off, Iftikhar Ahmed had a wild slog, it took the outside edge and went past short third man ",
        "event": "FOUR",
        "clip": "clip_18.1_at_406.3850687568_115698_1.mp4",
        "batsman": "Iftikhar Ahmed",
        "bowler": "Haris Rauf"
    },
    {
        "over": "18.1",
        "commentary": " Haris Rauf to Kamran Ghulam, 1 run, full on middle-leg, clipped away towards deep mid-wicket, B0$ ",
        "event": "TEAM_HUNDRED",
        "clip": "clip_18.1_at_406.3850687568_115698_1.mp4",
        "batsman": "Kamran Ghulam",
        "bowler": "Haris Rauf"
    },
    {
        "over": "17.5",
        "commentary": " Shaheen Afridi to Michael Bracewell, B0$ Caught by Billings!! B1$He's nicked it through. Slower delivery full and wide outside off, Michael Bracewell looked to drive it through the covers and got a healthy edge through to the keeper. Billings went up and so did the bowler almost belatedly, finger went up and Michael Bracewell didn't bother hanging around. B2$ ",
        "event": "WICKET",
        "clip": "clip_17.4_at_369.61689586928003_115698_1.mp4",
        "batsman": "Michael Bracewell",
        "bowler": "Shaheen Afridi"
    },
    {
        "over": "17.4",
        "commentary": " Shaheen Afridi to Michael Bracewell, B0$, another poor delivery, full-toss on the pads, all Michael Bracewell had to do was help it on its way down to the fine-leg ropes ",
        "event": "FOUR",
        "clip": "clip_17.3_at_362.84381139_115698_1.mp4",
        "batsman": "Michael Bracewell",
        "bowler": "Shaheen Afridi"
    },
    {
        "over": "16.4",
        "commentary": " Raza to Iftikhar Ahmed, B0$, just fraction short and put away, Iftikhar Ahmed pressed back and heaved it over deep mid-wicket, connected well and it sailed over ",
        "event": "SIX",
        "clip": "clip_16.3_at_356.07072691072_115698_1.mp4",
        "batsman": "Iftikhar Ahmed",
        "bowler": "Sikandar Raza"
    },
    {
        "over": "15.4",
        "commentary": " Rishad Hossain to Turner, B0$ Caught by Zaman Khan!! B1$ He's hurt himself a little but he's held on to the catch! Full and wide outside off, Turner looked to drag it across the line with a sweep but could only manage a top-edge, it lobbed up over the keeper's head and Zaman Khan covered good ground to his right from short fine-leg before diving to complete this catch. HIt his knee hard into the turf while landing but he seems okay. Turner is gone. B2$ ",
        "event": "WICKET",
        "clip": "clip_15.3_at_318.33497052616_115698_1.mp4",
        "batsman": "Ashton Turner",
        "bowler": "Rishad Hossain"
    },
    {
        "over": "15.2",
        "commentary": " Rishad Hossain to Turner, B0$B1$ Full on off-stump, Turner whipped it away wristily, wasn't far to long-on's right but he had no chance of stopping it ",
        "event": "FOUR",
        "clip": "clip_15.1_at_309.6267190528_115698_1.mp4",
        "batsman": "Ashton Turner",
        "bowler": "Rishad Hossain"
    },
    {
        "over": "15.1",
        "commentary": " Rishad Hossain to Turner, B0$, B1$ Tossed up full on off-stump, Turner plants his front-leg forward and mows it over long-on ",
        "event": "SIX",
        "clip": "clip_15.0_at_302.85363457352_115698_1.mp4",
        "batsman": "Ashton Turner",
        "bowler": "Rishad Hossain"
    },
    {
        "over": "14.2",
        "commentary": " Raza to Yasir Khan, B0$ Caught by Shafique!! B1$Massive wicket this and Yasir Khan has to walk back 13 short of his hundred. Raza strikes and suddenly the Qalandars have an opening. Full on middle, was a carrom ball, Yasir Khan probably didn't pick it, he looked to sweep it away and it took the top-edge before flying down towards deep square leg, Shafique ran to his left and took a very good catch. Ends a very entertaining knock from Yasir Khan. B2$ ",
        "event": "WICKET",
        "clip": "clip_14.1_at_298.01571708832_115698_1.mp4",
        "batsman": "Yasir Khan",
        "bowler": "Sikandar Raza"
    },
    {
        "over": "13.3",
        "commentary": " Rishad Hossain to Usman Khan, B0$ Caught by Asif Afridi!! B1$ The partnership has been broken. Length delivery on off-stump, Usman Khan looked to reverse-scoop this over third man but he couldn't clear the man. Didn't hit it well enough and the fielder took an easy catch. Usman Khan has played a good hand though. B2$ ",
        "event": "WICKET",
        "clip": "clip_13.2_at_275.7612966564_115698_1.mp4",
        "batsman": "Usman Khan",
        "bowler": "Rishad Hossain"
    },
    {
        "over": "12.5",
        "commentary": " Haris Rauf to Usman Khan, B0$, B1$ Slower length delivery on off-stump, Usman Khan backed away and slapped it up and over extra cover ",
        "event": "FOUR",
        "clip": "clip_12.4_at_260.27996070376_115698_1.mp4",
        "batsman": "Usman Khan",
        "bowler": "Haris Rauf"
    },
    {
        "over": "12.4",
        "commentary": " Haris Rauf to Usman Khan, 2 runs, fraction short on off-stump, heaved away towards deep mid-wicket, couple more ",
        "event": "TEAM_HUNDRED",
        "clip": "clip_12.4_at_260.27996070376_115698_1.mp4",
        "batsman": "Usman Khan",
        "bowler": "Haris Rauf"
    },
    {
        "over": "12.1",
        "commentary": " Haris Rauf to Usman Khan, B0$,B1$ Good length delivery on middle, Usman Khan just tucked it away easily towards fine-leg, beat the man at short fine and it raced away ",
        "event": "FOUR,PARTNERSHIP",
        "clip": "clip_12.0_at_247.70137524224_115698_1.mp4",
        "batsman": "Usman Khan",
        "bowler": "Haris Rauf"
    },
    {
        "over": "11.2",
        "commentary": " Rishad Hossain to Yasir Khan, B0$,B1$ Length delivery on off-stump, Yasir Khan leans in and attempts the same shot - a slog-sweep. He connects this time and it sails over cow corner ",
        "event": "SIX",
        "clip": "clip_11.1_at_221.57662082216_115698_1.mp4",
        "batsman": "Yasir Khan",
        "bowler": "Rishad Hossain"
    },
    {
        "over": "10.5",
        "commentary": " Mitchell to Usman Khan, B0$, I0$ slower ball outside off, Usman lofts it over mid-off and picks up four more. Not quite off the middle but enough to clear the fielder inside the ring ",
        "event": "FOUR",
        "clip": "clip_10.4_at_205.12770137248_115698_1.mp4",
        "batsman": "Usman Khan",
        "bowler": "Daryl Mitchell"
    },
    {
        "over": "10.4",
        "commentary": " Mitchell to Yasir Khan, 1 run, full pitcher outside off, Yasir drives straight to Shaheen at extra cover and he has a shy at the non-striker's end as Usman was well down the crease, does not hit the target and concedes the single ",
        "event": "RUNOUT_MISS",
        "clip": "clip_10.3_at_197.38703339616_115698_1.mp4",
        "batsman": "Yasir Khan",
        "bowler": "Daryl Mitchell"
    },
    {
        "over": "10.2",
        "commentary": " Mitchell to Yasir Khan, B0$, one of his smaller sixes today. Back of a length delivery and at Mitchell's pace it just sits up, Yasir pulls it backward of square and just manages to clear the rope ",
        "event": "SIX",
        "clip": "clip_10.1_at_178.03536345536_115698_1.mp4",
        "batsman": "Yasir Khan",
        "bowler": "Daryl Mitchell"
    },
    {
        "over": "8.5",
        "commentary": " Mitchell to Usman Khan, B0$, that's better. Conventional and he collects the boundary. Short and outside off, Usman cuts it square of the wicket and beats the deep backward point fielder ",
        "event": "TEAM_HUNDRED,FOUR",
        "clip": "clip_8.4_at_160.61886050864_115698_1.mp4",
        "batsman": "Usman Khan",
        "bowler": "Daryl Mitchell"
    },
    {
        "over": "5.1",
        "commentary": " Haris Rauf to Rizwan, B0$, back of a length delivery angled in, Rizwan is cramped for room but manages to get the pull away to the left of short fine, beats the fieder's dive and picks up the boundary ",
        "event": "FOUR",
        "clip": "clip_5.0_at_103.53143418328_115698_1.mp4",
        "batsman": "Mohammad Rizwan",
        "bowler": "Haris Rauf"
    },
    {
        "over": "4.4",
        "commentary": " Zaman Khan to Yasir Khan, B0$, repeat of the second ball. Once again Zaman offers an overpitched delivery, Yasir hit the first one to the right of mid-off and this one to the left, the line was slightly outside off and hence Yasir went to the left of mid-off ",
        "event": "TEAM_FIFTY,PARTNERSHIP,FOUR",
        "clip": "clip_4.3_at_89.01768172768_115698_1.mp4",
        "batsman": "Yasir Khan",
        "bowler": "Zaman Khan"
    },
    {
        "over": "4.2",
        "commentary": " Zaman Khan to Yasir Khan, B0$, B1$, goes from bad to worse for Zaman. He offers a half volley on off which Yasir does not miss - smashes it powerfully over mid-off, couple of bounces and over the rope. He has overstepped and has to deal with a B2$.. ",
        "event": "FOUR",
        "clip": "clip_4.2_at_88.05009823064_115698_1.mp4",
        "batsman": "Yasir Khan",
        "bowler": "Zaman Khan"
    },
    {
        "over": "4.1",
        "commentary": " Zaman Khan to Yasir Khan, B0$, clubbed! Zaman starts with a slower ball - I0$ length ball and Yasir picked the bones out of that, he spotted it early and launched for a 93 meter six over deep mid-wicket ",
        "event": "SIX",
        "clip": "clip_4.0_at_73.53634577504_115698_1.mp4",
        "batsman": "Yasir Khan",
        "bowler": "Zaman Khan"
    },
    {
        "over": "2.1",
        "commentary": " Shaheen Afridi to Yasir Khan, B0$, shot! Shaheen goes round the wicket and angles it right into the pads, Yasir picks it up nonchalantly and deposits it for a maximum over deep square leg. He made it look too easy.. ",
        "event": "SIX",
        "clip": "clip_2.0_at_36.76817288752_115698_1.mp4",
        "batsman": "Yasir Khan",
        "bowler": "Shaheen Afridi"
    },
    {
        "over": "19.1",
        "commentary": " Joshua Little to Haris Rauf, B0$ Caught by Yasir Khan!! B1$ Just short of length on off-stump, Haris Rauf looks to heave it away but can only manage a top-edge, it flies down towards deep square leg, fielder judges it well and completes the catch. B2$ ",
        "event": "WICKET",
        "clip": "clip_19.0_at_920.17190568504_115698_2.mp4",
        "batsman": "Haris Rauf",
        "bowler": "Joshua Little"
    },
    {
        "over": "18.5",
        "commentary": " Willey to Raza, B0$, B1$ Full outside off, Raza skewed it high up in the air looking to go over extra cover, man there never settled under it, kept circling around and over-ran it a bit, just got a hand on it but couldn't stop it from going for four either ",
        "event": "FOUR,DROPPED",
        "clip": "clip_18.4_at_882.43614930048_115698_2.mp4",
        "batsman": "Sikandar Raza",
        "bowler": "David Willey"
    },
    {
        "over": "18.4",
        "commentary": " Willey to Raza, B0$,B1$ Full and straight on middle, Raza smokes it away over deep mid-wicket ",
        "event": "SIX",
        "clip": "clip_18.3_at_872.7603143300801_115698_2.mp4",
        "batsman": "Sikandar Raza",
        "bowler": "David Willey"
    },
    {
        "over": "18.1",
        "commentary": " Willey to Asif Afridi, B0$ Caught by Usman Khan!! B1$Full and wide outside off, Asif Afridi throws his hands at it and can only manage a healthy edge through to the keeper who makes no mistake. B2$ ",
        "event": "WICKET",
        "clip": "clip_18.0_at_864.05206285672_115698_2.mp4",
        "batsman": "Asif Afridi",
        "bowler": "David Willey"
    },
    {
        "over": "17.5",
        "commentary": " Joshua Little to Raza, B0$, B1$ Length delivery on off-stump, Raza hangs back and thumps it over long-off, great strike! Is there a little life left in this contest? ",
        "event": "SIX",
        "clip": "clip_17.4_at_856.3113948804_115698_2.mp4",
        "batsman": "Sikandar Raza",
        "bowler": "Joshua Little"
    },
    {
        "over": "16.4",
        "commentary": " Ubaid Shah to Raza, B0$,B1$ Length delivery wide outside off, Raza reached out and scythed it away over backward point ",
        "event": "FOUR",
        "clip": "clip_16.3_at_848.5707269040801_115698_2.mp4",
        "batsman": "Sikandar Raza",
        "bowler": "Ubaid Shah"
    },
    {
        "over": "16.3",
        "commentary": " Ubaid Shah to Raza, B0$, B1$ Slot-ball on off-stump, Raza cleared his front-leg and smoked it into the stands at deep mid-wicket ",
        "event": "SIX",
        "clip": "clip_16.2_at_838.89489193368_115698_2.mp4",
        "batsman": "Sikandar Raza",
        "bowler": "Ubaid Shah"
    },
    {
        "over": "15.5",
        "commentary": " Usama Mir to Raza, 1 run, B0$ Flatter delivery on off-stump, Raza flat-batted it straight to Iftikhar Ahmed at long-on, he ran in a few paces and put it down ",
        "event": "DROPPED",
        "clip": "clip_15.4_at_835.02455794552_115698_2.mp4",
        "batsman": "Sikandar Raza",
        "bowler": "Usama Mir"
    },
    {
        "over": "15.3",
        "commentary": " Usama Mir to Shaheen Afridi, B0$ Caught by Willey!! B1$ Tossed up full outside off, Shaheen Afridi leant in looking to slog-sweep, couldn't get hold of it and he holed out to the man at long-on. Lahore 7 down now. B2$ ",
        "event": "WICKET",
        "clip": "clip_15.2_at_820.51080548992_115698_2.mp4",
        "batsman": "Shaheen Afridi",
        "bowler": "Usama Mir"
    },
    {
        "over": "15.1",
        "commentary": " Usama Mir to Raza, 1 run, tossed up full outside off, driven out to sweeper cover ",
        "event": "TEAM_HUNDRED",
        "clip": "clip_15.0_at_815.67288800472_115698_2.mp4",
        "batsman": "Sikandar Raza",
        "bowler": "Usama Mir"
    },
    {
        "over": "14.3",
        "commentary": " Ubaid Shah to Billings, B0$,B1$ Full and just outside off, in the slot once more and Billings doens't miss out, he smokes it over long-on, some pressure on the bowler now ",
        "event": "SIX",
        "clip": "clip_14.2_at_784.71021609944_115698_2.mp4",
        "batsman": "Sam Billings",
        "bowler": "Ubaid Shah"
    },
    {
        "over": "12.4",
        "commentary": " Willey to Raza, B0$, superbly struck! Full outside off, Raza gets forward and drives it away firmly towards  deep extra cover, man at long-off has no chance ",
        "event": "FOUR",
        "clip": "clip_12.3_at_766.32612965568_115698_2.mp4",
        "batsman": "Sikandar Raza",
        "bowler": "David Willey"
    },
    {
        "over": "12.3",
        "commentary": " Willey to Raza, B0$, misfield and it runs away! Length delivery on the pads, Raza just glanced it very fine, Mir at short fine-leg couldn't stop it with a dive ",
        "event": "FOUR",
        "clip": "clip_12.2_at_758.58546167936_115698_2.mp4",
        "batsman": "Sikandar Raza",
        "bowler": "David Willey"
    },
    {
        "over": "11.2",
        "commentary": " Usama Mir to Rishad Hossain, B0$ Bowled!! B1$ That's a dreadful shot. Full on off-stump, a wrong-un, Rishad Hossain cleared his front-leg and slogged right across the line, he missed it completely and middle-stump was pegged back. Lahore in some real trouble now. Usama Mir strikes in his very first over and Multan are in the driver's seat. B2$ ",
        "event": "WICKET",
        "clip": "clip_11.1_at_718.91453830072_115698_2.mp4",
        "batsman": "Rishad Hossain",
        "bowler": "Usama Mir"
    },
    {
        "over": "10.4",
        "commentary": " Joshua Little to Billings, B0$, B1$ Just a fraction short on off-stump, Billings hangs back and pulls it away firmly through mid-wicket this time, finds the gap and it races away ",
        "event": "FOUR",
        "clip": "clip_10.3_at_714.07662081552_115698_2.mp4",
        "batsman": "Sam Billings",
        "bowler": "Joshua Little"
    },
    {
        "over": "10.3",
        "commentary": " Joshua Little to Billings, B0$, length delivery on off-stump, Billings stays leg-side and thumps this over mid-off who was up in the ring ",
        "event": "FOUR",
        "clip": "clip_10.2_at_707.30353633624_115698_2.mp4",
        "batsman": "Sam Billings",
        "bowler": "Joshua Little"
    },
    {
        "over": "10.2",
        "commentary": " Joshua Little to Billings, B0$, B1$ Dug into the track on middle-leg, Billings hung back and pulled it away hard to the deep square leg ropes, just cleared it ",
        "event": "TEAM_HUNDRED,SIX",
        "clip": "clip_10.1_at_701.498035354_115698_2.mp4",
        "batsman": "Sam Billings",
        "bowler": "Joshua Little"
    },
    {
        "over": "9.4",
        "commentary": " Ubaid Shah to Billings, B0$, short of length on middle-leg, used the pace and angle to swivel pull this, sailed all the way over the deep backward square leg ropes ",
        "event": "SIX",
        "clip": "clip_9.3_at_695.69253437176_115698_2.mp4",
        "batsman": "Sam Billings",
        "bowler": "Ubaid Shah"
    },
    {
        "over": "9.3",
        "commentary": " Ubaid Shah to Billings, no run, B0$ Length delivery on off-stump, punched to cover, Billings was halfway down the track before being sent back, Rizwan the fielder, threw it way over the keeper ",
        "event": "RUNOUT_MISS",
        "clip": "clip_9.3_at_695.69253437176_115698_2.mp4",
        "batsman": "Sam Billings",
        "bowler": "Ubaid Shah"
    },
    {
        "over": "9.1",
        "commentary": " Ubaid Shah to Mitchell, B0$ Bowled!! B1$Good length delivery just outside off, hit the deck and nipped back in a shade to go straight through the gate and uproot off-stump. Excellent delivery this, the length had Mitchell caught in his crease and pushing at it, he didn't even lay a bat on that. Lahore in trouble now. B2$ ",
        "event": "WICKET",
        "clip": "clip_9.1_at_685.04911590432_115698_2.mp4",
        "batsman": "Daryl Mitchell",
        "bowler": "Ubaid Shah"
    },
    {
        "over": "8.4",
        "commentary": " Michael Bracewell to Shafique, B0$ Caught by Usman Khan!! Excellent review by Usman Khan. Credit to Rizwan as well to trust his keeper because Bracewell wasn't sure. Fired down leg, Shafique swivels and attempts to help the pull along the way, the ball brushes the glove and Usman takes a good catch moving to his left. He was confident from the start and his skipper obliged by challenging the onfield call. B1$ ",
        "event": "WICKET,UDRS",
        "clip": "clip_8.3_at_659.8919449812801_115698_2.mp4",
        "batsman": "Abdullah Shafique",
        "bowler": "Michael Bracewell"
    },
    {
        "over": "7.4",
        "commentary": " Usama Mir to Mitchell, B0$, lovely shot! Flighted delivery on off, Mitchell moves across and whips it off the pads over mid-wicket, right between deep mid-wicket and long-on, one bounce and over the ropes ",
        "event": "FOUR",
        "clip": "clip_7.3_at_648.2809430168_115698_2.mp4",
        "batsman": "Daryl Mitchell",
        "bowler": "Usama Mir"
    },
    {
        "over": "6.4",
        "commentary": " Iftikhar Ahmed to Mitchell, B0$, much needed hit for Lahore. I0$ quicker delivery outside off, Mitchell shuffles across and pumps it down the ground, no problem clearing the rope ",
        "event": "SIX",
        "clip": "clip_6.3_at_641.5078585375201_115698_2.mp4",
        "batsman": "Daryl Mitchell",
        "bowler": "Iftikhar Ahmed"
    },
    {
        "over": "5.3",
        "commentary": " Joshua Little to Shafique, B0$, another delivery on leg-stump, Shafique flicks it over square leg and teases Yasir near the rope, the ball bounces and beats the outstretched hand of Yasir ",
        "event": "FOUR",
        "clip": "clip_5.2_at_639.57269154344_115698_2.mp4",
        "batsman": "Abdullah Shafique",
        "bowler": "Joshua Little"
    },
    {
        "over": "5.1",
        "commentary": " Joshua Little to Shafique, B0$, short ball around leg, Shafique stays inside the line and pulls it fine. That was a gift first up from Little ",
        "event": "TEAM_FIFTY,FOUR",
        "clip": "clip_5.0_at_626.99410608192_115698_2.mp4",
        "batsman": "Abdullah Shafique",
        "bowler": "Joshua Little"
    },
    {
        "over": "3.2",
        "commentary": " Michael Bracewell to Mohammad Naeem, B0$ Caught by Iftikhar Ahmed!! Bracewell provides the breakthrough. Good catch by Iftikhar. Tossed up on off, but there's some turn and Naeem gets the slog sweep high on the bat, the ball skies towards deep mid-wicket and Iftikhar takes it close to the rope. Judged it nicely and ensured he held on with both hands. B1$ ",
        "event": "WICKET",
        "clip": "clip_3.1_at_570.8742632536_115698_2.mp4",
        "batsman": "Mohammad Naeem",
        "bowler": "Michael Bracewell"
    },
    {
        "over": "2.4",
        "commentary": " Willey to Fakhar Zaman, B0$, Zaman winning the battle at the moment. He charges down, gets under this length delivery and thumps it flat over mid-on, one bounce and over the ropes. Willey under pressure.. ",
        "event": "FOUR",
        "clip": "clip_2.3_at_563.13359527728_115698_2.mp4",
        "batsman": "Fakhar Zaman",
        "bowler": "David Willey"
    },
    {
        "over": "2.3",
        "commentary": " Willey to Fakhar Zaman, B0$, short and banged into the wicket, Zaman gets into a nice position and nails the pull backward of square. He rolled his wrists over to keep it down and place it in the gap. Now a few words exchanged between Willey and Zaman ",
        "event": "FOUR",
        "clip": "clip_2.2_at_557.32809429504_115698_2.mp4",
        "batsman": "Fakhar Zaman",
        "bowler": "David Willey"
    },
    {
        "over": "2.2",
        "commentary": " Willey to Fakhar Zaman, B0$, that's classic Zaman. Willey offers him width outside off and Zaman pumps it down the ground, uses the space and hammers it back over Willey. Second six for him.. ",
        "event": "SIX",
        "clip": "clip_2.2_at_557.32809429504_115698_2.mp4",
        "batsman": "Fakhar Zaman",
        "bowler": "David Willey"
    },
    {
        "over": "0.2",
        "commentary": " Willey to Mohammad Naeem, B0$, glorious! Naeem is off the mark with a fabulous shot. Full pitcher on off, Naeem plants his foot forward and brings his bat down straight, drives it down the ground and does not even bother to look if the ball reached the fence ",
        "event": "FOUR",
        "clip": "clip_0.1_at_503.14341846080004_115698_2.mp4",
        "batsman": "Mohammad Naeem",
        "bowler": "David Willey"
    },
    {
        "over": "19.3",
        "commentary": " Talat to Hasan Ali, B0$, B1$ The Karachi Kings end up on the right side of this thrilling chase! Just a fraction short on middle, Hasan Ali hung back and pulled it away into the gap at deep square leg, big gap and it hit the ropes! ",
        "event": "FOUR",
        "clip": "clip_19.3_at_967.58349704_115696_2.mp4",
        "batsman": "Hasan Ali",
        "bowler": "Hussain Talat"
    },
    {
        "over": "19.1",
        "commentary": " Talat to Khushdil, B0$, B1$ Length delivery outside off, bit of width and Khushdil crunched it away towards deep backward point, not the best fielding effort in the deep either, the fielder slid across but didn't stop it ",
        "event": "FOUR",
        "clip": "clip_19.0_at_947.26424360216_115696_2.mp4",
        "batsman": "Khushdil Shah",
        "bowler": "Hussain Talat"
    },
    {
        "over": "18.1",
        "commentary": " Ali Raza to Aamer Jamal, B0$ Lbw!! B1$ Hard length delivery outside off, just nipped in a touch and skidded through, Aamer Jamal was caught in his crease and he missed it completely, hit him quite high on the pad but umpire Paul Reiffel raised the finger. Aamer Jamal opted to go upstairs, no bat involved, impact in line and hitting the wickets on umpire's call! So he's on his way. Now Karachi are 8 down and in real danger of being bowled out. B2$ ",
        "event": "WICKET,UDRS",
        "clip": "clip_18.0_at_911.46365421168_115696_2.mp4",
        "batsman": "Aamer Jamal",
        "bowler": "Ali Raza"
    },
    {
        "over": "17.2",
        "commentary": " Alzarri Joseph to Khushdil, B0$, B1$ Very full on off-stump, just about missed the yorker and Khushdil drove it back past mid-off with the full face of the bat ",
        "event": "FOUR",
        "clip": "clip_17.1_at_893.07956776792_115696_2.mp4",
        "batsman": "Khushdil Shah",
        "bowler": "Alzarri Joseph"
    },
    {
        "over": "16.3",
        "commentary": " Wood to Warner, B0$ Bowled!! B1$ Luke Wood is having an outstanding night. Slower delivery full and straight on middle, Warner was caught in his crease and played all around it, went straight through and crashed into the stumps. Massive wicket at this stage of the game. Warner goes for a well-made 60 and the game is wide open once more. B2$ ",
        "event": "WICKET",
        "clip": "clip_16.2_at_861.1493123656_115696_2.mp4",
        "batsman": "David Warner",
        "bowler": "Luke Wood"
    },
    {
        "over": "15.5",
        "commentary": " Alzarri Joseph to Warner, B0$, B1$ Very full on off-stump, Warner made room and lofted it over mid-off who was up in the ring, timed it well enough to clear the man ",
        "event": "FOUR",
        "clip": "clip_15.4_at_857.27897837744_115696_2.mp4",
        "batsman": "David Warner",
        "bowler": "Alzarri Joseph"
    },
    {
        "over": "14.3",
        "commentary": " Arif Yaqoob to Warner, 1 run, full outside off, carved out towards sweeper cover, B0$ ",
        "event": "FIFTY",
        "clip": "clip_14.2_at_834.05697444848_115696_2.mp4",
        "batsman": "David Warner",
        "bowler": "Arif Yaqoob"
    },
    {
        "over": "13.5",
        "commentary": " Ali Raza to Warner, B0$,B1$ Full and straight on middle-leg from round the wicket, Warner just used the pace and angle to help it away over the man at short fine-leg ",
        "event": "FOUR",
        "clip": "clip_13.4_at_808.89980352544_115696_2.mp4",
        "batsman": "David Warner",
        "bowler": "Ali Raza"
    },
    {
        "over": "13.1",
        "commentary": " Ali Raza to Warner, B0$,B1$ Length delivery slanting across outside off, bit too much width and Warner slapped it away hard over backward point ",
        "event": "FOUR",
        "clip": "clip_13.0_at_801.15913554912_115696_2.mp4",
        "batsman": "David Warner",
        "bowler": "Ali Raza"
    },
    {
        "over": "12.5",
        "commentary": " Arif Yaqoob to Nabi, B0$ Caught by Abdul Samad!! B1$ Here's another timely wicket for Peshawar just as Karachi were taking back control. A length delivery outside off, googly and it kept a shade low, Nabi just shoveled it straight out to the man at cow corner, simple catch taken and now the Kings have lost half their side. B2$ ",
        "event": "WICKET",
        "clip": "clip_12.4_at_784.71021609944_115696_2.mp4",
        "batsman": "Mohammad Nabi",
        "bowler": "Arif Yaqoob"
    },
    {
        "over": "12.1",
        "commentary": " Arif Yaqoob to Nabi, B0$, B1$ Floated up full just outside off, Nabi leans across and paddles it fine to get another boundary ",
        "event": "FOUR",
        "clip": "clip_12.0_at_776.00196462608_115696_2.mp4",
        "batsman": "Mohammad Nabi",
        "bowler": "Arif Yaqoob"
    },
    {
        "over": "11.5",
        "commentary": " Saim Ayub to Nabi, B0$,B1$ Nabi with the big strike, floated up full and wide outside off, Nabi made a bit of room and carved it away over deep extra cover ",
        "event": "SIX",
        "clip": "clip_11.4_at_766.32612965568_115696_2.mp4",
        "batsman": "Mohammad Nabi",
        "bowler": "Saim Ayub"
    },
    {
        "over": "11.1",
        "commentary": " Saim Ayub to Warner, B0$,B1$ Full on leg-stump, Warner brings out the full switch-hit, turns into a right-hander and sweeps it away over third man ",
        "event": "FOUR",
        "clip": "clip_11.1_at_762.45579566752_115696_2.mp4",
        "batsman": "David Warner",
        "bowler": "Saim Ayub"
    },
    {
        "over": "10.3",
        "commentary": " Arif Yaqoob to Irfan Khan, B0$ Irfan Khan Run Out!! 1 run completed. B1$ The Kings have thrown another wicket away. Warner can't believe it. Flatter delivery on middle, worked towards deep backward square leg, it was Irfan Khan that called for the second run and he ends up well short as a good throw comes in. Easy work for Mohammad Haris who whipped the bails off. The pressure continues to mount on Karachi. Warner isn't happy about this at all, he continues to gesture in disappointment. B2$ ",
        "event": "WICKET",
        "clip": "clip_10.2_at_703.43320234808_115696_2.mp4",
        "batsman": "Irfan Khan",
        "bowler": "Arif Yaqoob"
    },
    {
        "over": "6.3",
        "commentary": " Alzarri Joseph to Warner, B0$,B1$ Length delivery wide outside off, Warner had a slash at that and got a thick bottom-edge that went past off-stump and down leg to beat the keeper ",
        "event": "TEAM_FIFTY,FOUR",
        "clip": "clip_6.2_at_687.95186639544_115696_2.mp4",
        "batsman": "David Warner",
        "bowler": "Alzarri Joseph"
    },
    {
        "over": "5.1",
        "commentary": " Ali Raza to Warner, B0$,B1$ Just a fraction short on middle-leg, Warner pulled it away past short fine-leg, wasn't very far from the fielder ",
        "event": "FOUR",
        "clip": "clip_5.0_at_669.56777995168_115696_2.mp4",
        "batsman": "David Warner",
        "bowler": "Ali Raza"
    },
    {
        "over": "4.3",
        "commentary": " Wood to Saad Baig, B0$, B1$ Banged in short on off-stump, Saad Baig picks it up early and pummels it away through mid-wicket ",
        "event": "FOUR",
        "clip": "clip_4.2_at_645.37819252568_115696_2.mp4",
        "batsman": "Saad Baig",
        "bowler": "Luke Wood"
    },
    {
        "over": "4.2",
        "commentary": "Wood to Saad Baig, leg byes, B0$, length delivery on middle-leg, just flicked a bit of his thigh pad on the way through and Mohammad Haris couldn't stop it, that looked pretty straight but there was hardly an appeal, B1$Peshawar have missed a trick",
        "event": "FOUR",
        "clip": "clip_4.1_at_635.7023575552801_115696_2.mp4",
        "batsman": "Saad Baig",
        "bowler": "Luke Wood"
    },
    {
        "over": "4.1",
        "commentary": " Wood to Saad Baig, B0$, B1$ A little overpitched just outside off, Saad Baig gets forward and creams it through the covers, picked the gap nicely ",
        "event": "FOUR",
        "clip": "clip_4.0_at_627.96168957896_115696_2.mp4",
        "batsman": "Saad Baig",
        "bowler": "Luke Wood"
    },
    {
        "over": "2.5",
        "commentary": " Wood to James Vince, B0$ Caught by Mohammad Haris!! B1$ Full on off-stump, was slanting across him and James Vince looked to flick that away uppishly, didn't shape back in like he expected it to and it went straight up off the leading edge, Mohammad Haris settled under it and took it easily. Second wicket for Luke Wood and he's sent the danger man back. Fantastic start for Peshawar. B2$ ",
        "event": "WICKET",
        "clip": "clip_2.4_at_603.77210215296_115696_2.mp4",
        "batsman": "James Vince",
        "bowler": "Luke Wood"
    },
    {
        "over": "2.1",
        "commentary": " Wood to Warner, B0$, B1$ Length delivery on just outside off, Warner gave himself some room and slapped it away into the gap at extra cover ",
        "event": "FOUR",
        "clip": "clip_2.0_at_576.67976423584_115696_2.mp4",
        "batsman": "David Warner",
        "bowler": "Luke Wood"
    },
    {
        "over": "1.3",
        "commentary": " Alzarri Joseph to James Vince, B0$,B1$ Just a fraction short on middle-leg, James Vince was looking to make room, he cleared his front-leg and pulled it down to deep backward square leg ",
        "event": "FOUR",
        "clip": "clip_1.2_at_545.71709233056_115696_2.mp4",
        "batsman": "James Vince",
        "bowler": "Alzarri Joseph"
    },
    {
        "over": "0.1",
        "commentary": "Wood to Seifert, B0$ Lbw!! B1$ Brilliant delivery to start off, full and hooping into the pads, got that to swing very late, it beat the inside edge and just brushed the front-pad before crashing into the back one. Umpire Rod Tucker remained unmoved and Zalmi decided to review. No bat involved and ball-tracker returns with three-reds. Seifert is gone for a golden duck. B2$",
        "event": "WICKET,UDRS",
        "clip": "clip_0.1_at_541.8467583424_115696_2.mp4",
        "batsman": "Tim Seifert",
        "bowler": "Luke Wood"
    },
    {
        "over": "18.1",
        "commentary": " Abbas Afridi to Abdul Samad, B0$ Caught by Mir Hamza!! Just a couple of runs by Abdul Samad tonight. Pitched up by the bowler down the leg-side, a touch slower and Abdul Samad swipes it straight to the fielder at short fine leg. That's the second wicket for Abbas Afridi.. B1$ ",
        "event": "WICKET",
        "clip": "clip_18.0_at_426.70432219464_115696_1.mp4",
        "batsman": "Abdul Samad",
        "bowler": "Abbas Afridi"
    },
    {
        "over": "16.2",
        "commentary": " Abbas Afridi to Mohammad Haris, B0$ Caught by Warner!! Mohammad Haris departs afer playing a cameo. He shimmies down the wicket and lofts this towards wide mid-off. An easy catch taken and Mohammad Haris us gone. Karachi Kings keep taking wickets at regular intervals. B1$ ",
        "event": "WICKET",
        "clip": "clip_16.1_at_362.84381139_115696_1.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Abbas Afridi"
    },
    {
        "over": "16.1",
        "commentary": " Abbas Afridi to Mohammad Haris, B0$, on a length outside off, Mohammad Haris swings across the line and gets an outside edge that flies down to the vacant third man region ",
        "event": "FOUR",
        "clip": "clip_16.0_at_341.55697445512_115696_1.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Abbas Afridi"
    },
    {
        "over": "14.5",
        "commentary": " Aamer Jamal to Mitchell Owen, B0$, short of a length on middle and leg, Mitchell Owen pulls it through mid-wicket for a rollicking boundary, beats the fielder in the deep ",
        "event": "FOUR",
        "clip": "clip_14.4_at_291.24263260904_115696_1.mp4",
        "batsman": "Mitchell Owen",
        "bowler": "Aamer Jamal"
    },
    {
        "over": "14.3",
        "commentary": " Aamer Jamal to Talat, B0$ Caught&Bowled!! Looks to play the scoop again, but the bowler is smart this time around. A leading edge is induced due to the lack of pace and the top edge has been taken by the bowler. Talat departs after playing a cameo. B1$ ",
        "event": "WICKET",
        "clip": "clip_14.2_at_274.79371315936_115696_1.mp4",
        "batsman": "Hussain Talat",
        "bowler": "Aamer Jamal"
    },
    {
        "over": "14.2",
        "commentary": " Aamer Jamal to Talat, B0$, scoops the length ball over short fine leg and manages to beat the fielder chasing it, nicely done ",
        "event": "FOUR",
        "clip": "clip_14.1_at_262.21512769784_115696_1.mp4",
        "batsman": "Hussain Talat",
        "bowler": "Aamer Jamal"
    },
    {
        "over": "13.4",
        "commentary": " Nabi to Mohammad Haris, B0$, back-to-back boundaries as Mohammad Haris rocks back and pulls this short ball away to the deep mid-wicket boundary ",
        "event": "FOUR",
        "clip": "clip_13.4_at_260.27996070376_115696_1.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Mohammad Nabi"
    },
    {
        "over": "12.2",
        "commentary": " Mir Hamza to Talat, B0$, on the shorter side, Talat pulls it over mid-wicket for four runs. Much needed for Peshawar Zalmi ",
        "event": "FOUR",
        "clip": "clip_12.1_at_228.34970530144_115696_1.mp4",
        "batsman": "Hussain Talat",
        "bowler": "Mir Hamza"
    },
    {
        "over": "11.4",
        "commentary": " Nabi to Talat, B0$, tossed up delivery at the stumps, Talat reverse sweeps this over backward point for four runs' ",
        "event": "FOUR",
        "clip": "clip_11.3_at_221.57662082216_115696_1.mp4",
        "batsman": "Hussain Talat",
        "bowler": "Mohammad Nabi"
    },
    {
        "over": "10.1",
        "commentary": " Abbas Afridi to Mohammad Haris, B0$, short and wide outside off, Mohammad Haris carves it through point for a rollicking boundary, great timing ",
        "event": "FOUR",
        "clip": "clip_10.0_at_207.06286836656_115696_1.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Abbas Afridi"
    },
    {
        "over": "9.2",
        "commentary": " Khushdil to Babar Azam, B0$, tad short outside off, Babar Azam rocks back in the crease and carves it through backward point. Manages to beat the fielder in the deep and moves into the 40s ",
        "event": "FOUR",
        "clip": "clip_9.1_at_184.80844793464001_115696_1.mp4",
        "batsman": "Babar Azam",
        "bowler": "Khushdil Shah"
    },
    {
        "over": "8.4",
        "commentary": " Aamer Jamal to Babar Azam, B0$, short ball down the leg-side, Babar Azam helps it away to the fine leg boundary for four runs ",
        "event": "FOUR",
        "clip": "clip_8.3_at_179.0029469524_115696_1.mp4",
        "batsman": "Babar Azam",
        "bowler": "Aamer Jamal"
    },
    {
        "over": "8.2",
        "commentary": " Aamer Jamal to Babar Azam, B0$, 50 up for PZ! Drifting on the pads and Babar Azam flicks it through square leg for four runs ",
        "event": "TEAM_FIFTY,FOUR",
        "clip": "clip_8.1_at_172.22986247312_115696_1.mp4",
        "batsman": "Babar Azam",
        "bowler": "Aamer Jamal"
    },
    {
        "over": "7.5",
        "commentary": " Nabi to Babar Azam, B0$, fired down the leg-side, Babar Azam goes for a paddle sweep, gets some feather and beats the keeper for four runs ",
        "event": "FOUR",
        "clip": "clip_7.4_at_157.71611001752_115696_1.mp4",
        "batsman": "Babar Azam",
        "bowler": "Mohammad Nabi"
    },
    {
        "over": "7.4",
        "commentary": " Nabi to Mohammad Haris, 1 run, in the air but safe! Mohammad Haris looks to whip across the line and the leading edge lobs towards mid-off. Nabi sprints back and tries to grab it, but it was out of his reach, a single taken ",
        "event": "OTHER",
        "clip": "clip_7.4_at_157.71611001752_115696_1.mp4",
        "batsman": "Mohammad Haris",
        "bowler": "Mohammad Nabi"
    },
    {
        "over": "6.5",
        "commentary": " Khushdil to Kohler-Cadmore, B0$ Caught by Irfan Khan!! That's an excellent catch at long-on. Kohler-Cadmore goes for the aerial route and lofts it towards long-on and Irfan Khan at long-on, charges in and completes an impressive catch with a forward dive. Kohler-Cadmore walks back without contributing much. B1$ ",
        "event": "WICKET",
        "clip": "clip_6.4_at_126.75343811224_115696_1.mp4",
        "batsman": "Tom Kohler-Cadmore",
        "bowler": "Khushdil Shah"
    },
    {
        "over": "6.4",
        "commentary": " Khushdil to Kohler-Cadmore, B0$, on the shorter side and Kohler-Cadmore has smoked it over deep mid-wicket for half-a-dozen. That's a huge six, almost hits the roof ",
        "event": "SIX",
        "clip": "clip_6.3_at_121.91552062704_115696_1.mp4",
        "batsman": "Tom Kohler-Cadmore",
        "bowler": "Khushdil Shah"
    },
    {
        "over": "5.5",
        "commentary": " Abbas Afridi to Babar Azam, B0$, shimmies down the wicket and pulls this towards deep mid-wicket, the fielder can't stop it despite putting a good effort ",
        "event": "FOUR",
        "clip": "clip_5.4_at_121.91552062704_115696_1.mp4",
        "batsman": "Babar Azam",
        "bowler": "Abbas Afridi"
    },
    {
        "over": "5.2",
        "commentary": " Abbas Afridi to Babar Azam, B0$, on a length around off, Babar Azam goes hard at it, goes for a lofted drive and the outside edge flies towards the third man fence ",
        "event": "FOUR",
        "clip": "clip_5.1_at_95.79076620696_115696_1.mp4",
        "batsman": "Babar Azam",
        "bowler": "Abbas Afridi"
    },
    {
        "over": "3.2",
        "commentary": " Hasan Ali to Babar Azam, B0$, pitched up by the bowler on off, Babar Azam drills it through mid-off for four runs ",
        "event": "FOUR",
        "clip": "clip_3.1_at_89.01768172768_115696_1.mp4",
        "batsman": "Babar Azam",
        "bowler": "Hasan Ali"
    },
    {
        "over": "2.2",
        "commentary": " Mir Hamza to Babar Azam, no run, B0$ Back of a length delivery on middle and leg, Babar Azam looks to nudge it away, gets a leading edge that flies straight back to the bowler. Mir Hamza gets his hands to it in his followthrough but doesn't latch on to the catch ",
        "event": "DROPPED",
        "clip": "clip_2.1_at_69.66601178688_115696_1.mp4",
        "batsman": "Babar Azam",
        "bowler": "Mir Hamza"
    },
    {
        "over": "0.2",
        "commentary": " Mir Hamza to Babar Azam, no run, B0$ He survives, the onfield decision has to be overturned. A length delivery that nips back in and Babar Azam gets beaten on his defence. Struck on the pads and the replays confirm this was sailing over the stumps ",
        "event": "UDRS",
        "clip": "clip_0.1_at_12.57858546152_115696_1.mp4",
        "batsman": "Babar Azam",
        "bowler": "Mir Hamza"
    },
    {
        "over": "19.4",
        "commentary": " Salman Irshad to Kamran Ghulam, B0$, full on the stumps, Kamran Ghulam clears his front leg and slogs it in the gap to the left of deep square ",
        "event": "FOUR",
        "clip": "clip_19.3_at_479.92141453184_115705_1.mp4",
        "batsman": "Kamran Ghulam",
        "bowler": "Salman Irshad"
    },
    {
        "over": "19.3",
        "commentary": " Salman Irshad to Kamran Ghulam, B0$, pitched up right in the zone outside off, Kamran Ghulam gets under it and clubs it over wide long-off for an B1$ ",
        "event": "SIX",
        "clip": "clip_19.2_at_463.47249508216_115705_1.mp4",
        "batsman": "Kamran Ghulam",
        "bowler": "Salman Irshad"
    },
    {
        "over": "18.3",
        "commentary": " Meredith to Usman Khan, B0$ Usman Khan Run Out!! 1 run completed. Stays leg-side of the short ball and slashes it to the left of sweeper cover, Usman Khan wanted two from the onset but it was never really on. A sharp throw from the fielder in the deep and Usman Khan was well short of his crease. B1$ ",
        "event": "WICKET",
        "clip": "clip_18.2_at_415.09332023016003_115705_1.mp4",
        "batsman": "Usman Khan",
        "bowler": "Riley Meredith"
    },
    {
        "over": "18.2",
        "commentary": " Meredith to Jordan, 1 run, slower full delivery outside off, Jordan goes hard and gets an under edge to the right of square leg ",
        "event": "TEAM_HUNDRED",
        "clip": "clip_18.2_at_415.09332023016003_115705_1.mp4",
        "batsman": "Chris Jordan",
        "bowler": "Riley Meredith"
    },
    {
        "over": "17.4",
        "commentary": " Holder to Iftikhar Ahmed, B0$ Caught by Gous!! Holder and his wicket-taking knack with the short balls continue. Hit the deck hard and hurried Iftikhar Ahmed for pace, the batter was trying to hook it fine and gloved it to the keeper. Easy take for Gous. B1$ ",
        "event": "WICKET",
        "clip": "clip_17.3_at_388.00098231304_115705_1.mp4",
        "batsman": "Iftikhar Ahmed",
        "bowler": "Jason Holder"
    },
    {
        "over": "16.4",
        "commentary": " Salman Irshad to Iftikhar Ahmed, B0$, I0$ short on the stumps, Iftikhar swivels and gets enough bat on the pull that beats the diving fielder to his left at short fine ",
        "event": "FOUR",
        "clip": "clip_16.3_at_378.32514734264_115705_1.mp4",
        "batsman": "Iftikhar Ahmed",
        "bowler": "Salman Irshad"
    },
    {
        "over": "15.2",
        "commentary": " Meredith to Michael Bracewell, B0$ Caught by Nawaz!! Slower short ball wide of off, Michael Bracewell heaves the pull and drags it off the thick inside half to the left of long-on. Nawaz moves across and takes a fine catch. B1$ ",
        "event": "WICKET",
        "clip": "clip_15.1_at_333.8163064788_115705_1.mp4",
        "batsman": "Michael Bracewell",
        "bowler": "Riley Meredith"
    },
    {
        "over": "15.1",
        "commentary": " Meredith to Michael Bracewell, B0$, short and wide of off, Michael Bracewell slashes and gets it racing past the fielder at backward point to his right ",
        "event": "FOUR",
        "clip": "clip_15.0_at_328.01080549656_115705_1.mp4",
        "batsman": "Michael Bracewell",
        "bowler": "Riley Meredith"
    },
    {
        "over": "13.3",
        "commentary": " Shadab Khan to Rizwan, B0$ Caught by Saad Masood!! Rizwan's scratchy knock comes to an end. He shimmies out of his crease, gets a bit too close to the pitch of the delivery and chips it off the toe end to the right of cover. Easy take for Masood. B1$ ",
        "event": "WICKET",
        "clip": "clip_13.2_at_272.85854616528_115705_1.mp4",
        "batsman": "Mohammad Rizwan",
        "bowler": "Shadab Khan"
    },
    {
        "over": "13.1",
        "commentary": " Shadab Khan to Usman Khan, B0$, Usman Khan premeditates, dances down the wicket and despite losing shape, he manages to power the loft over long-off. Just had enough power behind that shot... ",
        "event": "SIX",
        "clip": "clip_13.0_at_261.2475442008_115705_1.mp4",
        "batsman": "Usman Khan",
        "bowler": "Shadab Khan"
    },
    {
        "over": "10.5",
        "commentary": " Imad Wasim to Usman Khan, B0$, quicker and shorter outside off, Usman Khan swivels and hammers the pull deep into the mid-wicket stands ",
        "event": "SIX",
        "clip": "clip_10.4_at_203.1925343784_115705_1.mp4",
        "batsman": "Usman Khan",
        "bowler": "Imad Wasim"
    },
    {
        "over": "10.3",
        "commentary": " Imad Wasim to Rizwan, B0$, advances and goes inside out over extra cover. Excellent use of the feet from Mohammad Rizwan. got close to the pitch of the delivery and timed it really well ",
        "event": "FOUR",
        "clip": "clip_10.2_at_192.54911591096_115705_1.mp4",
        "batsman": "Mohammad Rizwan",
        "bowler": "Imad Wasim"
    },
    {
        "over": "9.4",
        "commentary": " Shadab Khan to Usman Khan, B0$, Usman Khan danced down the wicket and got close to the pitch of the delivery, used his bottom hand power to thump an B1$ over long-off ",
        "event": "SIX",
        "clip": "clip_9.3_at_185.77603143168_115705_1.mp4",
        "batsman": "Usman Khan",
        "bowler": "Shadab Khan"
    },
    {
        "over": "8.5",
        "commentary": " Nawaz to Usman Khan, B0$, B1$ Usman Khan gets a thick top-edge on the slog sweep and Saad Masood couldn't cling on at deep mid-wicket. He ran across to his right, but got into a slightly awkward position at the last moment. The ball bursts through his fingers and hits the boundary cushions... ",
        "event": "SIX,DROPPED",
        "clip": "clip_8.4_at_166.42436149088002_115705_1.mp4",
        "batsman": "Usman Khan",
        "bowler": "Mohammad Nawaz"
    },
    {
        "over": "6.4",
        "commentary": " Nawaz to Yasir Khan, B0$ Caught by (sub)Muhammad Shahzad!! Nawaz provides the much-needed breakthrough. Full and spinning away outside off, Yasir Khan stays low and looks to swipe it over long-on. Gets a thick top-edge and picks out the fielder at long-on. B1$ ",
        "event": "WICKET",
        "clip": "clip_6.3_at_125.78585461520001_115705_1.mp4",
        "batsman": "Yasir Khan",
        "bowler": "Mohammad Nawaz"
    },
    {
        "over": "2.2",
        "commentary": " Holder to Yasir Khan, B0$, I0$ pitched up just outside off, Yasir Khan clears his front leg and whips it powerfully in the gap between mid-on and mid-wicket ",
        "event": "FOUR",
        "clip": "clip_2.1_at_30.96267190528_115705_1.mp4",
        "batsman": "Yasir Khan",
        "bowler": "Jason Holder"
    },
    {
        "over": "0.1",
        "commentary": " Meredith to Yasir Khan, B0$, full on leg stump, Yasir Khan whips it over mid-wicket and times it superbly to get it racing to the mid-wicket fence ",
        "event": "FOUR",
        "clip": "clip_0.1_at_14.5137524556_115705_1.mp4",
        "batsman": "Yasir Khan",
        "bowler": "Riley Meredith"
    },
    {
        "over": "17.1",
        "commentary": " Ubaid Shah to Gous, B0$, B1$ Gous finishes it in style. Short of length delivery and Gous picked the bones out of that, he waits on the back foot and nails the pull over cow corner ",
        "event": "SIX",
        "clip": "clip_17.1_at_992.74066796304_115705_2.mp4",
        "batsman": "Andries Gous",
        "bowler": "Ubaid Shah"
    },
    {
        "over": "16.2",
        "commentary": " Jordan to Gous, 1 run, short of length delivery, Gous rolls his wrists over and pulls it to deep mid-wicket ",
        "event": "PARTNERSHIP",
        "clip": "clip_16.1_at_946.29666010512_115705_2.mp4",
        "batsman": "Andries Gous",
        "bowler": "Chris Jordan"
    },
    {
        "over": "16.1",
        "commentary": " Jordan to Gous, B0$, lovely shot! Fullish delivery on middle and leg, Gous makes room and lofts through the line. Offers the full face of the bat and times it beautifully, no problem in clearing the long-off fence ",
        "event": "SIX",
        "clip": "clip_16.0_at_937.58840863176_115705_2.mp4",
        "batsman": "Andries Gous",
        "bowler": "Chris Jordan"
    },
    {
        "over": "15.5",
        "commentary": " Usama Mir to Nawaz, B0$, drifted across outside off, Nawaz had the room to free his hands and he brings out the slog sweep, swings towards wide long-on and sends it sailing for a 82-meter six ",
        "event": "TEAM_HUNDRED,SIX",
        "clip": "clip_15.4_at_930.81532415248_115705_2.mp4",
        "batsman": "Mohammad Nawaz",
        "bowler": "Usama Mir"
    },
    {
        "over": "14.2",
        "commentary": " Ubaid Shah to Gous, B0$, edged and four! Good length ball around off, Gous tries to force it through the outside edge and gets a thick outside edge, goes wide of Usman and races to third man ",
        "event": "FOUR",
        "clip": "clip_14.1_at_916.30157169688_115705_2.mp4",
        "batsman": "Andries Gous",
        "bowler": "Ubaid Shah"
    },
    {
        "over": "13.5",
        "commentary": " Usama Mir to Gous, 1 run, nearly! B0$ Tossed up around off, Gous makes room and slices the drive towards backward point, Bracwell moves to his right and dives, sticks his hand out and almost scoops it up ",
        "event": "DROPPED",
        "clip": "clip_13.4_at_904.6905697324_115705_2.mp4",
        "batsman": "Andries Gous",
        "bowler": "Usama Mir"
    },
    {
        "over": "13.3",
        "commentary": " Usama Mir to Nawaz, B0$, flighted on middle and leg, Nawaz sits down and swipes it backward of square. He generated enough power to beat the fielder in the deep ",
        "event": "FOUR",
        "clip": "clip_13.2_at_892.11198427088_115705_2.mp4",
        "batsman": "Mohammad Nawaz",
        "bowler": "Usama Mir"
    },
    {
        "over": "11.5",
        "commentary": " Iftikhar Ahmed to Gous, B0$, B1$ It has been a fine knock. Credit to the team management for sticking with him even though he had failed in the first four games. He raises his bat and soaks in the applause. This is dragged short and Gous is quick to pounce, he rocks back and nails the pull over cow corner ",
        "event": "FIFTY,SIX",
        "clip": "clip_11.4_at_857.27897837744_115705_2.mp4",
        "batsman": "Andries Gous",
        "bowler": "Iftikhar Ahmed"
    },
    {
        "over": "11.4",
        "commentary": " Iftikhar Ahmed to Gous, B0$, misses the yorker length and Gous cashes in, there was width on offer as well and Gous drills it down the ground, giviing Little no chance near long-off ",
        "event": "FOUR",
        "clip": "clip_11.4_at_857.27897837744_115705_2.mp4",
        "batsman": "Andries Gous",
        "bowler": "Iftikhar Ahmed"
    },
    {
        "over": "10.4",
        "commentary": " Michael Bracewell to Munro, B0$ Caught by Iftikhar Ahmed!! Bracewell breaks the partnership. But is it too late? Iftikhar takes the catch and stands there with his hands on his hips. Tossed up delivery on off, Munro kneels down and does not quite middle the slog sweep, hits it straighter than he would have liked and Iftikhar settles near long-on take the catch. B1$ ",
        "event": "WICKET",
        "clip": "clip_10.3_at_818.57563849584_115705_2.mp4",
        "batsman": "Colin Munro",
        "bowler": "Michael Bracewell"
    },
    {
        "over": "10.3",
        "commentary": " Michael Bracewell to Munro, B0$, touch quicker and the length is full, Munro stays leg-side and drives it inside out past extra cover. The shot was a tad uppish but the placement was spot on as Rizwan had no chance of stopping that ",
        "event": "FOUR",
        "clip": "clip_10.2_at_809.86738702248_115705_2.mp4",
        "batsman": "Colin Munro",
        "bowler": "Michael Bracewell"
    },
    {
        "over": "9.2",
        "commentary": " Iftikhar Ahmed to Munro, B0$, they have adjusted to the surface superbly here. This slow and there's some turn, but Munro waits on the back foot and punches it over extra cover. He had ample time to pick his spot and Munro did it with ease ",
        "event": "TEAM_HUNDRED,FOUR",
        "clip": "clip_9.1_at_739.2337917385601_115705_2.mp4",
        "batsman": "Colin Munro",
        "bowler": "Iftikhar Ahmed"
    },
    {
        "over": "8.3",
        "commentary": " Usama Mir to Gous, B0$, Usama not having a good day. The Sultans were banking on him in the middle overs. But he's already gone for 21 in 1.3 overs. Tossed up and the length is full, Gous crouches low and gets under the slog sweep, nails it towards deep mid-wicket and watches it sail over ",
        "event": "SIX",
        "clip": "clip_8.2_at_731.49312376224_115705_2.mp4",
        "batsman": "Andries Gous",
        "bowler": "Usama Mir"
    },
    {
        "over": "8.2",
        "commentary": " Usama Mir to Gous, B0$, hammered! Lovely use of the feet. Gous comes down the track, gets to the pitch of the flighted delivery and drives it flat towards long-off, one bounce and over the ropes ",
        "event": "FOUR",
        "clip": "clip_8.1_at_724.72003928296_115705_2.mp4",
        "batsman": "Andries Gous",
        "bowler": "Usama Mir"
    },
    {
        "over": "5.2",
        "commentary": " Jordan to Munro, B0$, in the air and over deep mid-wicket. Slower ball from Jordan and ends up on the pads, Munro picks it up nonchalantly and flicks it aerially. There was a fielder lurking near deep mid-wicket and Munro managed to elude his leap ",
        "event": "SIX",
        "clip": "clip_5.1_at_679.24361492208_115705_2.mp4",
        "batsman": "Colin Munro",
        "bowler": "Chris Jordan"
    },
    {
        "over": "4.5",
        "commentary": " Ubaid Shah to Gous, B0$, first time Ubaid goes full and pays the price. It was the slower and lands it right in the arc, Gous drives uppishly back over Munro and beats the mid-on fielder comfortably ",
        "event": "TEAM_FIFTY,FOUR",
        "clip": "clip_4.5_at_669.56777995168_115705_2.mp4",
        "batsman": "Andries Gous",
        "bowler": "Ubaid Shah"
    },
    {
        "over": "4.3",
        "commentary": " Ubaid Shah to Gous, B0$, Gous was ready for the hard length this time, he stays on the back foot and allows the ball to come, pulls it in front of square and the ball lands on the ad cushions near wide long-on ",
        "event": "SIX",
        "clip": "clip_4.2_at_643.4430255316_115705_2.mp4",
        "batsman": "Andries Gous",
        "bowler": "Ubaid Shah"
    },
    {
        "over": "3.4",
        "commentary": " Joshua Little to Munro, B0$, shot! Once again Little goes short and into the surface, Munro rolls his wrists over and pulls it in front of square. There are two fielders in the deep on the leg-side but Munro split them perfectly ",
        "event": "FOUR",
        "clip": "clip_3.3_at_633.7671905612_115705_2.mp4",
        "batsman": "Colin Munro",
        "bowler": "Joshua Little"
    },
    {
        "over": "3.2",
        "commentary": " Joshua Little to Munro, B0$, angled in and ends up around leg-stump, Munro goes back and flicks it backward of square. There was a fielder in the deep but he was square and had no chance of stopping that ",
        "event": "FOUR",
        "clip": "clip_3.1_at_619.2534381056_115705_2.mp4",
        "batsman": "Colin Munro",
        "bowler": "Joshua Little"
    },
    {
        "over": "1.5",
        "commentary": " Michael Bracewell to Sahibzada Farhan, B0$, poor bowling. Another long hop from Bracewell and Farhan makes the most of it, he rocks back and hammers the pull well beyond the deep mid-wicket fence ",
        "event": "SIX",
        "clip": "clip_1.4_at_547.65225932464_115705_2.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Michael Bracewell"
    },
    {
        "over": "1.1",
        "commentary": " Michael Bracewell to Sahibzada Farhan, B0$, that's a half tracker and Farhan is quick to pounce, he makes room and cracks the cut in front of square ",
        "event": "FOUR",
        "clip": "clip_1.1_at_541.8467583424_115705_2.mp4",
        "batsman": "Sahibzada Farhan",
        "bowler": "Michael Bracewell"
    },
    {
        "over": "0.2",
        "commentary": " Joshua Little to Gous, B0$, glorious! That's a confidence boosting shot. Inswinger from a fullish length, Gous offers the full face of the bat and drives it straight down the ground. All timing and placement which leaves even Little impressed ",
        "event": "FOUR",
        "clip": "clip_0.1_at_515.72200392232_115705_2.mp4",
        "batsman": "Andries Gous",
        "bowler": "Joshua Little"
    },
    {
        "over": "19.5",
        "commentary": " T Natarajan to Shivam Dube, B0$, low full-toss on the stumps, flicked and it's high and handsome over deep mid-wicket, flies away. Crucial six for CSK ",
        "event": "SIX",
        "clip": "clip_19.4_at_284.0_91555_1.mp4",
        "batsman": "Shivam Dube",
        "bowler": "T Natarajan"
    },
    {
        "over": "19.3",
        "commentary": " T Natarajan to Dhoni, B0$, was half a chance at deep square leg and credit to the fielder who went for it. A low full-toss on the stumps, flicked in the air and Abhishek was the man, dives forward but the ball bounces just in front of the right hand and goes under it, runs away for four and again the crowd go bonkers ",
        "event": "FOUR,DROPPED",
        "clip": "clip_19.2_at_277.0_91555_1.mp4",
        "batsman": "MS Dhoni",
        "bowler": "T Natarajan"
    },
    {
        "over": "19.2",
        "commentary": " T Natarajan to Gaikwad, B0$ Caught by Nitish Reddy!! Gaikwad falls for 98. A slower ball full on the stumps, Gaikwad does not get under it for the loft, miscues it and it's down deep mid-wicket's throat. Nitish makes no mistake. Gaikwad shakes his head as he walks back for 98. Fine innings nonetheless. B1$ ",
        "event": "WICKET",
        "clip": "clip_19.1_at_264.0_91555_1.mp4",
        "batsman": "Ruturaj Gaikwad",
        "bowler": "T Natarajan"
    },
    {
        "over": "17.1",
        "commentary": " Cummins to Shivam Dube, B0$, smashed. A wide slower ball off-cutter outside off on a good length, Shivam Dube gets across and pummels it straight down the ground. Unreal power ",
        "event": "SIX",
        "clip": "clip_17.0_at_252.0_91555_1.mp4",
        "batsman": "Shivam Dube",
        "bowler": "Pat Cummins"
    },
    {
        "over": "16.5",
        "commentary": " T Natarajan to Shivam Dube, B0$, that's the power of Shivam Dube. A low full-toss outside off, he gets forward and lofts with an open face, flies over deep extra-cover. Went 80m ",
        "event": "SIX",
        "clip": "clip_16.4_at_245.0_91555_1.mp4",
        "batsman": "Shivam Dube",
        "bowler": "T Natarajan"
    },
    {
        "over": "16.2",
        "commentary": " T Natarajan to Shivam Dube, B0$, T Natarajan misses the yorker length and Shivam Dube puts him away. A half-volley on the stumps, Shivam Dube clears his front leg and heaves over deep mid-wicket, just cleared the man ",
        "event": "SIX",
        "clip": "clip_16.1_at_239.0_91555_1.mp4",
        "batsman": "Shivam Dube",
        "bowler": "T Natarajan"
    },
    {
        "over": "15.5",
        "commentary": " Cummins to Gaikwad, B0$, superb from Gaikwad. A low full-toss outside off, Gaikwad reaches for it and opens the face of the bat to slice it between backward point and short third man ",
        "event": "FOUR",
        "clip": "clip_15.4_at_226.0_91555_1.mp4",
        "batsman": "Ruturaj Gaikwad",
        "bowler": "Pat Cummins"
    },
    {
        "over": "14.4",
        "commentary": " Bhuvneshwar to Gaikwad, B0$, half-volley on the stumps, and Gaikwad does not miss out, holds the shape and lofts with a full face straight down the ground, mid-off was anyway in ",
        "event": "FOUR",
        "clip": "clip_14.3_at_218.0_91555_1.mp4",
        "batsman": "Ruturaj Gaikwad",
        "bowler": "Bhuvneshwar Kumar"
    },
    {
        "over": "14.3",
        "commentary": " Bhuvneshwar to Gaikwad, B0$, smashed over deep mid-wicket. A short delivery at Gaikwad who stands tall and pulls meatily into the stands, was the slower short ball too ",
        "event": "SIX",
        "clip": "clip_14.2_at_209.0_91555_1.mp4",
        "batsman": "Ruturaj Gaikwad",
        "bowler": "Bhuvneshwar Kumar"
    },
    {
        "over": "13.5",
        "commentary": " Unadkat to Gaikwad, B0$, slower ball off-cutter on the stumps, dug in and Gaikwad shuffles across to pull, hits it all the way over short fine-leg, flies away ",
        "event": "SIX",
        "clip": "clip_13.4_at_202.0_91555_1.mp4",
        "batsman": "Ruturaj Gaikwad",
        "bowler": "Jaydev Unadkat"
    },
    {
        "over": "13.3",
        "commentary": " Unadkat to Mitchell, B0$ Caught by Nitish Reddy!! Straight to deep mid-wicket. A low full-toss on the stumps, Mitchell slugs it and finds deep mid-wicket. They are now checking for the height on this. Mitchell has been asked to wait. And he has been given out as the umps have a word with him. The partnership is broken. B1$ ",
        "event": "WICKET",
        "clip": "clip_13.2_at_192.0_91555_1.mp4",
        "batsman": "Daryl Mitchell",
        "bowler": "Jaydev Unadkat"
    },
    {
        "over": "12.4",
        "commentary": " Cummins to Mitchell, 1 run,B0$ short of length on off-stump, pulled away to deep square leg ",
        "event": "FIFTY",
        "clip": "clip_12.3_at_180.0_91555_1.mp4",
        "batsman": "Daryl Mitchell",
        "bowler": "Pat Cummins"
    },
    {
        "over": "12.3",
        "commentary": " Cummins to Mitchell, B0$,B1$ That's the 100-run stand as well, full and very wide outside off, Mitchell shuffled all the way across and scooped it over short third man's head ",
        "event": "FOUR,PARTNERSHIP",
        "clip": "clip_12.2_at_172.0_91555_1.mp4",
        "batsman": "Daryl Mitchell",
        "bowler": "Pat Cummins"
    },
    {
        "over": "11.2",
        "commentary": " Shahbaz Ahmed to Mitchell, B0$, B1$ Full on middle, Mitchell made room very early before lofting it straight back over the bowler's head, split long-on and long-off to perfection ",
        "event": "FOUR",
        "clip": "clip_11.1_at_165.0_91555_1.mp4",
        "batsman": "Daryl Mitchell",
        "bowler": "Shahbaz Ahmed"
    },
    {
        "over": "11.1",
        "commentary": " Shahbaz Ahmed to Mitchell, B0$,B1$ Flatter delivery drifting on to the pads, Mitchell leant in and just paddled it very fine, no chance for the man at short fine-leg ",
        "event": "FOUR",
        "clip": "clip_11.1_at_165.0_91555_1.mp4",
        "batsman": "Daryl Mitchell",
        "bowler": "Shahbaz Ahmed"
    },
    {
        "over": "10.5",
        "commentary": " T Natarajan to Mitchell, B0$,B1$ Back of a length and outside off, must have been pace off too and Mitchell sliced it up and over third short third man, he had to really reach out for that ",
        "event": "TEAM_HUNDRED,FOUR",
        "clip": "clip_10.4_at_149.0_91555_1.mp4",
        "batsman": "Daryl Mitchell",
        "bowler": "T Natarajan"
    },
    {
        "over": "8.1",
        "commentary": " Cummins to Mitchell, B0$, B1$ Full and just outside off, Mitchell just lofted straight through the line and over long-off, impeccable timing and it sailed over, 50-run stand comes up as well ",
        "event": "SIX,PARTNERSHIP",
        "clip": "clip_8.0_at_124.0_91555_1.mp4",
        "batsman": "Daryl Mitchell",
        "bowler": "Pat Cummins"
    },
    {
        "over": "6.2",
        "commentary": " Unadkat to Mitchell, B0$, B1$ Touch too full outside off, Mitchell smacked it through extra cover, was struck on the up and right into the gap ",
        "event": "FOUR",
        "clip": "clip_6.1_at_110.0_91555_1.mp4",
        "batsman": "Daryl Mitchell",
        "bowler": "Jaydev Unadkat"
    },
    {
        "over": "5.2",
        "commentary": " T Natarajan to Gaikwad, B0$, B1$ Length delivery angling into the pads, Gaikwad stood still and just helped it on its way with a pull, beat short fine-leg to his left and raced away ",
        "event": "FOUR",
        "clip": "clip_5.1_at_105.0_91555_1.mp4",
        "batsman": "Ruturaj Gaikwad",
        "bowler": "T Natarajan"
    },
    {
        "over": "4.5",
        "commentary": " Bhuvneshwar to Gaikwad, B0$, B1$Fuller and wider outside off, Gaikwad leans into a cover drive and it rockets away to the ropes, man at deep point sprinted and dived to his right but couldn't stop it ",
        "event": "FOUR",
        "clip": "clip_4.4_at_98.0_91555_1.mp4",
        "batsman": "Ruturaj Gaikwad",
        "bowler": "Bhuvneshwar Kumar"
    },
    {
        "over": "4.4",
        "commentary": " Bhuvneshwar to Gaikwad, B0$,B1$ Length delivery just outside off, nothing wrong with this delivery, Gaikwad hung back and waited for it before opening the face of the bat to cut it to the right of the man at backward point, superb placement ",
        "event": "FOUR",
        "clip": "clip_4.3_at_93.0_91555_1.mp4",
        "batsman": "Ruturaj Gaikwad",
        "bowler": "Bhuvneshwar Kumar"
    },
    {
        "over": "4.2",
        "commentary": " Bhuvneshwar to Mitchell, B0$, B1$ Pitched up full on middle, Mitchell stood still and just lofted this straight back over the bowler, held his shape nicely and timed it to perfection ",
        "event": "FOUR",
        "clip": "clip_4.1_at_87.0_91555_1.mp4",
        "batsman": "Daryl Mitchell",
        "bowler": "Bhuvneshwar Kumar"
    },
    {
        "over": "3.5",
        "commentary": " Shahbaz Ahmed to Gaikwad, B0$,B1$ Tossed up full on middle, Gaikwad backs away to make room and creams the drive to the deep extra cover fence ",
        "event": "FOUR",
        "clip": "clip_3.4_at_81.0_91555_1.mp4",
        "batsman": "Ruturaj Gaikwad",
        "bowler": "Shahbaz Ahmed"
    },
    {
        "over": "3.4",
        "commentary": " Shahbaz Ahmed to Gaikwad, B0$,B1$ Length delivery just outside off, Gaikwad presses back and across, just creates enough width and cuts it away sharply through to the deep point fence ",
        "event": "FOUR",
        "clip": "clip_3.3_at_74.0_91555_1.mp4",
        "batsman": "Ruturaj Gaikwad",
        "bowler": "Shahbaz Ahmed"
    },
    {
        "over": "2.5",
        "commentary": "Bhuvneshwar to Rahane, B0$ Caught by Shahbaz Ahmed!! B1$Length delivery just outside off, Rahane looked to loft this through the line and over mid-on, wasn't full enough for that but he went through with his shot anyway. Ended up being a bit of a nothing shot as it shot straight up in the air before going down to the man at deep mid-wicket. Simple catch and Rahane walks back. This has been a slow start for CSK! B2$",
        "event": "WICKET",
        "clip": "clip_2.4_at_62.0_91555_1.mp4",
        "batsman": "Ajinkya Rahane",
        "bowler": "Bhuvneshwar Kumar"
    },
    {
        "over": "2.1",
        "commentary": " Bhuvneshwar to Rahane, B0$, B1$ Length delivery on off-stump, Rahane shuffled forward and across and used the pace to pull it away to deep backward square leg ",
        "event": "FOUR",
        "clip": "clip_2.0_at_57.0_91555_1.mp4",
        "batsman": "Ajinkya Rahane",
        "bowler": "Bhuvneshwar Kumar"
    },
    {
        "over": "18.5",
        "commentary": " Mustafizur to Unadkat, B0$ Caught by Moeen Ali!! All over! Full outside off, Unadkat goes hard on the drive and hits it straight to extra cover. Comfortably held by Moeen, and CSK complete a comprehensive win. B1$ ",
        "event": "WICKET",
        "clip": "clip_18.4_at_561.0_91555_2.mp4",
        "batsman": "Jaydev Unadkat",
        "bowler": "Mustafizur Rahman"
    },
    {
        "over": "18.2",
        "commentary": " Mustafizur to Shahbaz Ahmed, B0$ Caught by Mitchell!! Mitchell is everywhere! B1$ as the ninth wicket goes down! Shahbaz looks surprised as he thought he had struck it well, but it goes only as far as deep backward square. Full on the pads, he whips it in the air, but the boundary sizes here are fairly decent. B2$ ",
        "event": "WICKET",
        "clip": "clip_18.1_at_544.0_91555_2.mp4",
        "batsman": "Shahbaz Ahmed",
        "bowler": "Mustafizur Rahman"
    },
    {
        "over": "18.1",
        "commentary": " Mustafizur to Shahbaz Ahmed, B0$, slower bouncer outside off, Shahbaz reaches out and upper-cuts it over short third ",
        "event": "FOUR",
        "clip": "clip_18.0_at_538.0_91555_2.mp4",
        "batsman": "Shahbaz Ahmed",
        "bowler": "Mustafizur Rahman"
    },
    {
        "over": "17.3",
        "commentary": " Tushar Deshpande to Cummins, B0$ Caught by Mitchell!! Fourth catch for Mitchell, and fourth wicket for Deshpande! Fuller than a length, Cummins looks to slog but only hits it as far as long-on. B1$ ",
        "event": "WICKET",
        "clip": "clip_17.2_at_523.0_91555_2.mp4",
        "batsman": "Pat Cummins",
        "bowler": "Tushar Deshpande"
    },
    {
        "over": "17.2",
        "commentary": " Tushar Deshpande to Cummins, no run, slower bouncer outside off, left alone, and there's another review from Cummins for a wide. Is it too high? No, it's passing around the head` ",
        "event": "UDRS",
        "clip": "clip_17.2_at_523.0_91555_2.mp4",
        "batsman": "Pat Cummins",
        "bowler": "Tushar Deshpande"
    },
    {
        "over": "16.4",
        "commentary": " Thakur to Cummins, B0$, full and wide outside off, Cummins throws his bat at it and carves it away through point. Goes very quickly to the boundary. Timing was excellent there, and came right off the middle ",
        "event": "FOUR",
        "clip": "clip_16.3_at_516.0_91555_2.mp4",
        "batsman": "Pat Cummins",
        "bowler": "Shardul Thakur"
    },
    {
        "over": "16.2",
        "commentary": " Thakur to Abdul Samad, B0$ Caught by (sub)Sameer Rizvi!! Samad holes out as well! Full and wide outside off, Samad looks to swing down the ground, doesn't get enough and it's catching practice for the substitute fielder at long-off. B1$ ",
        "event": "WICKET",
        "clip": "clip_16.1_at_501.0_91555_2.mp4",
        "batsman": "Abdul Samad",
        "bowler": "Shardul Thakur"
    },
    {
        "over": "15.5",
        "commentary": "Pathirana to Klaasen, B0$ Caught by Mitchell!! Straight down the throat of Mitchell at long-on, and he takes his third catch of the evening. No real fireworks from Klaasen today as he goes for 20 off 21 balls. It's a low full toss on middle, he looks to launch down the ground but fails to get under it. Doesn't get much elevation and it's a comfortable catch. B1$",
        "event": "WICKET",
        "clip": "clip_15.4_at_491.0_91555_2.mp4",
        "batsman": "Heinrich Klaasen",
        "bowler": "Matheesha Pathirana"
    },
    {
        "over": "15.2",
        "commentary": " Pathirana to Abdul Samad, B0$, finally Samad gets hold of one! 140.6kph, right in the slot on off, and he hammers it over long-on ",
        "event": "SIX",
        "clip": "clip_15.1_at_482.0_91555_2.mp4",
        "batsman": "Abdul Samad",
        "bowler": "Matheesha Pathirana"
    },
    {
        "over": "12.1",
        "commentary": " Thakur to Abdul Samad, B0$, back of a length outside off, plenty of width and Samad slaps it through extra cover. It races away to the fence ",
        "event": "FOUR",
        "clip": "clip_12.0_at_475.0_91555_2.mp4",
        "batsman": "Abdul Samad",
        "bowler": "Shardul Thakur"
    },
    {
        "over": "11.3",
        "commentary": " Jadeja to Klaasen, B0$, Klaasen will smash anything on that length all day. Full in the slot on middle, he clears the front leg and launches it over long-off ",
        "event": "SIX",
        "clip": "clip_11.2_at_470.0_91555_2.mp4",
        "batsman": "Heinrich Klaasen",
        "bowler": "Ravindra Jadeja"
    },
    {
        "over": "10.5",
        "commentary": " Pathirana to Markram, B0$ Bowled!! B1$ Markram is left flummoxed by a Pathirana special. A 147kph yorker on the stumps, bends in slightly, Markram goes for a forceful drive and is beaten comprehensively as it crashes into middle. Sunrisers in tatters. B2$ ",
        "event": "WICKET",
        "clip": "clip_10.4_at_452.0_91555_2.mp4",
        "batsman": "Aiden Markram",
        "bowler": "Matheesha Pathirana"
    },
    {
        "over": "8.5",
        "commentary": "Jadeja to Nitish Reddy, B0$ Caught by Dhoni!! B1$ at 104kph, takes Reddy by surprise and sends him packing! He gets a thick top-edge while going for the pull shot, and it goes high in the air. Dhoni takes it comfortably. Jadeja has a big smile on his face, having outfoxed Reddy with this variation. He banged it in and got it to rise above the chest. Imagine his delight at bouncing someone out. B2$",
        "event": "WICKET",
        "clip": "clip_8.4_at_436.0_91555_2.mp4",
        "batsman": "Nitish Reddy",
        "bowler": "Ravindra Jadeja"
    },
    {
        "over": "5.1",
        "commentary": " Mustafizur to Markram, B0$, full and wide outside off, angling away from Markram who drives and it's skewed off the thickish outside half, through backward point and no chance for Jadeja at sweeper cover ",
        "event": "FOUR",
        "clip": "clip_5.0_at_424.0_91555_2.mp4",
        "batsman": "Aiden Markram",
        "bowler": "Mustafizur Rahman"
    },
    {
        "over": "3.5",
        "commentary": " Tushar Deshpande to Abhishek Sharma, B0$ Caught by Mitchell!! Abhishek Sharma too finds deep point and Tushar Deshpande has three. Looked like the slower short ball outside off, slashed and Mitchell tracks back to take it. A bit more elevation and Abhishek Sharma would have got six. SRH fans are shell-shocked. B1$ ",
        "event": "WICKET",
        "clip": "clip_3.4_at_407.0_91555_2.mp4",
        "batsman": "Abhishek Sharma",
        "bowler": "Tushar Deshpande"
    },
    {
        "over": "3.4",
        "commentary": " Tushar Deshpande to Abhishek Sharma, B0$, smashed. On a back of a length just outside off, slapped straight down the ground and that's dismissive ",
        "event": "FOUR",
        "clip": "clip_3.3_at_399.0_91555_2.mp4",
        "batsman": "Abhishek Sharma",
        "bowler": "Tushar Deshpande"
    },
    {
        "over": "2.3",
        "commentary": " Chahar to Markram, B0$, poor ball, short and wide outside off, cut over backward point and that's consecutive fours for Markram ",
        "event": "FOUR",
        "clip": "clip_2.2_at_395.0_91555_2.mp4",
        "batsman": "Aiden Markram",
        "bowler": "Deepak Chahar"
    },
    {
        "over": "2.2",
        "commentary": " Chahar to Markram, B0$, Markram is away with a fine shot. A short of length delivery just outside off, he punches wide of cover-point to his left, runs away ",
        "event": "FOUR",
        "clip": "clip_2.1_at_388.0_91555_2.mp4",
        "batsman": "Aiden Markram",
        "bowler": "Deepak Chahar"
    },
    {
        "over": "1.5",
        "commentary": "Tushar Deshpande to Head, B0$ Caught by Mitchell!! Head holes out. Full slower ball and wide outside off, he goes on one knee and carves it, does not get the elevation or power to clear deep point and Mitchell isn't dropping them. Massive wicket for CSK. B1$",
        "event": "WICKET",
        "clip": "clip_1.4_at_362.0_91555_2.mp4",
        "batsman": "Travis Head",
        "bowler": "Tushar Deshpande"
    },
    {
        "over": "1.3",
        "commentary": " Tushar Deshpande to Abhishek Sharma, B0$, now Abhishek Sharma gets into the act. Full and around off, no mercy as Abhishek Sharma swings it a mile into the deep mid-wicket stands and he did not get it off the middle too ",
        "event": "SIX",
        "clip": "clip_1.2_at_350.0_91555_2.mp4",
        "batsman": "Abhishek Sharma",
        "bowler": "Tushar Deshpande"
    }
]